{
  "id": 4161,
  "title": "An Unforgettable Gala: Trinidad’s 55th Anniversary Celebration in Qatar",
  "slug": "an-unforgettable-gala-trinidads-55th-anniversary-celebration-in-qatar",
  "status": "publish",
  "date_created": "2024-12-07T19:00:34",
  "date_modified": "2024-12-14T21:22:36",
  "author": {
    "id": 2,
    "name": "Woody Ghsoubi",
    "login": "wghsoubi"
  },
  "categories": [
    "Events",
    "International Events"
  ],
  "content": {
    "raw": "<p data-pm-slice=\"1 1 []\">On December 7, 2024, my wife, Najat Abdo, and I had the privilege of attending the grand finale of Trinidad’s 55th Anniversary celebrations. Held at the Doha Exhibition &amp; Convention Center in Qatar, this spectacular event was hosted by Habanos, S.A., in collaboration with Phoenicia Cyprus Ltd. and Qatar Duty Free. It was a fitting tribute to a year dedicated to one of Cuba’s most iconic cigar brands.</p>\nUpon arriving at the event, we were warmly greeted with Trinidad Topes and Trinidad Vigía cigars, which we enjoyed during the cocktail party. It set a relaxed and sophisticated tone, perfectly complementing the atmosphere of anticipation. The evening itself was a showcase of elegance and artistry. It began with an exquisite six-course dinner prepared by the renowned Chef David Sosson, Airport Chef of the Year in 2023. Every dish was paired thoughtfully, offering a gastronomic experience that truly reflected the refined nature of the Trinidad brand.\n\nOne of the highlights of the evening was a breathtaking performance by Lebanon’s very own Mayyas dance group, winners of <em>America’s Got Talent</em> in 2022. Watching their stunning performance was a moment of immense pride for Najat and me, as it beautifully highlighted the cultural vibrancy and talent of our homeland.\n\nThroughout the event, guests were taken on an incredible journey through Trinidad’s finest cigars. We started with the Trinidad Robusto Extra, followed by the Cabildos, and finally enjoyed the legendary Fundadores. Each cigar was paired with signature cocktails designed to enhance their distinct flavors. The \"Havana Night\" was an impeccable match for the Robusto Extra, while the \"El Ingenio\" brought out the best in the Cabildos, creating a memorable tasting experience.\n<p data-pm-slice=\"1 1 []\">As the owners of Club Mareva Beirut, Najat and I felt deeply honored to represent Lebanon at such a prestigious gathering. We were the only retailers from Lebanon to attend the event, though we truly wished to have seen other Lebanese retailers join us in celebrating this remarkable milestone. It was inspiring to connect with enthusiasts and industry leaders from across the globe, reinforcing our belief in the unifying and celebratory power of cigars.</p>\nThe night concluded with a spectacular performance by Michel Khalife and his band, followed by The Managers, led by Alain Crevet, CEO of S.T. Dupont. Their music brought electrifying energy to an already unforgettable evening. It was the perfect finale to a celebration of Trinidad’s rich heritage and artistry.\n<p data-pm-slice=\"1 1 []\">Reflecting on this exceptional event, I can confidently say that this was one of the best cigar events my wife and I have ever attended. Najat and I feel more motivated than ever to continue fostering the cigar community in Lebanon and beyond. The Trinidad 55th Anniversary Gala was not just a celebration; it was a testament to the enduring legacy of a brand that has captivated aficionados worldwide.</p>\n<p data-pm-slice=\"1 1 []\"><img class=\"aligncenter size-full wp-image-4165\" src=\"https://clubmarevabeirut.com/wp-content/uploads/2024/12/IMG_2940-scaled.jpeg\" alt=\"\" width=\"1920\" height=\"2560\" /></p>",
    "clean": "<p data-pm-slice=\"1 1 []\">On December 7, 2024, my wife, Najat Abdo, and I had the privilege of attending the grand finale of Trinidad’s 55th Anniversary celebrations. Held at the Doha Exhibition &amp; Convention Center in Qatar, this spectacular event was hosted by Habanos, S.A., in collaboration with Phoenicia Cyprus Ltd. and Qatar Duty Free. It was a fitting tribute to a year dedicated to one of Cuba’s most iconic cigar brands.</p>\nUpon arriving at the event, we were warmly greeted with Trinidad Topes and Trinidad Vigía cigars, which we enjoyed during the cocktail party. It set a relaxed and sophisticated tone, perfectly complementing the atmosphere of anticipation. The evening itself was a showcase of elegance and artistry. It began with an exquisite six-course dinner prepared by the renowned Chef David Sosson, Airport Chef of the Year in 2023. Every dish was paired thoughtfully, offering a gastronomic experience that truly reflected the refined nature of the Trinidad brand.\n\nOne of the highlights of the evening was a breathtaking performance by Lebanon’s very own Mayyas dance group, winners of <em>America’s Got Talent</em> in 2022. Watching their stunning performance was a moment of immense pride for Najat and me, as it beautifully highlighted the cultural vibrancy and talent of our homeland.\n\nThroughout the event, guests were taken on an incredible journey through Trinidad’s finest cigars. We started with the Trinidad Robusto Extra, followed by the Cabildos, and finally enjoyed the legendary Fundadores. Each cigar was paired with signature cocktails designed to enhance their distinct flavors. The \"Havana Night\" was an impeccable match for the Robusto Extra, while the \"El Ingenio\" brought out the best in the Cabildos, creating a memorable tasting experience.\n<p data-pm-slice=\"1 1 []\">As the owners of Club Mareva Beirut, Najat and I felt deeply honored to represent Lebanon at such a prestigious gathering. We were the only retailers from Lebanon to attend the event, though we truly wished to have seen other Lebanese retailers join us in celebrating this remarkable milestone. It was inspiring to connect with enthusiasts and industry leaders from across the globe, reinforcing our belief in the unifying and celebratory power of cigars.</p>\nThe night concluded with a spectacular performance by Michel Khalife and his band, followed by The Managers, led by Alain Crevet, CEO of S.T. Dupont. Their music brought electrifying energy to an already unforgettable evening. It was the perfect finale to a celebration of Trinidad’s rich heritage and artistry.\n<p data-pm-slice=\"1 1 []\">Reflecting on this exceptional event, I can confidently say that this was one of the best cigar events my wife and I have ever attended. Najat and I feel more motivated than ever to continue fostering the cigar community in Lebanon and beyond. The Trinidad 55th Anniversary Gala was not just a celebration; it was a testament to the enduring legacy of a brand that has captivated aficionados worldwide.</p>\n<p data-pm-slice=\"1 1 []\"><img class=\"aligncenter size-full wp-image-4165\" src=\"https://clubmarevabeirut.com/wp-content/uploads/2024/12/IMG_2940-scaled.jpeg\" alt=\"\" width=\"1920\" height=\"2560\" /></p>",
    "text": "On December 7, 2024, my wife, Najat Abdo, and I had the privilege of attending the grand finale of Trinidad’s 55th Anniversary celebrations. Held at the Doha Exhibition & Convention Center in Qatar, this spectacular event was hosted by Habanos, S.A., in collaboration with Phoenicia Cyprus Ltd. and Qatar Duty Free. It was a fitting tribute to a year dedicated to one of Cuba’s most iconic cigar brands. Upon arriving at the event, we were warmly greeted with Trinidad Topes and Trinidad Vigía cigars, which we enjoyed during the cocktail party. It set a relaxed and sophisticated tone, perfectly complementing the atmosphere of anticipation. The evening itself was a showcase of elegance and artistry. It began with an exquisite six-course dinner prepared by the renowned Chef David Sosson, Airport Chef of the Year in 2023. Every dish was paired thoughtfully, offering a gastronomic experience that truly reflected the refined nature of the Trinidad brand. One of the highlights of the evening was a breathtaking performance by Lebanon’s very own Mayyas dance group, winners of America’s Got Talent in 2022. Watching their stunning performance was a moment of immense pride for Najat and me, as it beautifully highlighted the cultural vibrancy and talent of our homeland. Throughout the event, guests were taken on an incredible journey through Trinidad’s finest cigars. We started with the Trinidad Robusto Extra, followed by the Cabildos, and finally enjoyed the legendary Fundadores. Each cigar was paired with signature cocktails designed to enhance their distinct flavors. The \"Havana Night\" was an impeccable match for the Robusto Extra, while the \"El Ingenio\" brought out the best in the Cabildos, creating a memorable tasting experience. As the owners of Club Mareva Beirut, Najat and I felt deeply honored to represent Lebanon at such a prestigious gathering. We were the only retailers from Lebanon to attend the event, though we truly wished to have seen other Lebanese retailers join us in celebrating this remarkable milestone. It was inspiring to connect with enthusiasts and industry leaders from across the globe, reinforcing our belief in the unifying and celebratory power of cigars. The night concluded with a spectacular performance by Michel Khalife and his band, followed by The Managers, led by Alain Crevet, CEO of S.T. Dupont. Their music brought electrifying energy to an already unforgettable evening. It was the perfect finale to a celebration of Trinidad’s rich heritage and artistry. Reflecting on this exceptional event, I can confidently say that this was one of the best cigar events my wife and I have ever attended. Najat and I feel more motivated than ever to continue fostering the cigar community in Lebanon and beyond. The Trinidad 55th Anniversary Gala was not just a celebration; it was a testament to the enduring legacy of a brand that has captivated aficionados worldwide."
  },
  "featured_image": {
    "original_url": "https://clubmarevabeirut.com/wp-content/uploads/2024/12/X8me0L4fNpl5.jpeg.jpg",
    "local_path": "images/clubmarevabeirut/2024/X8me0L4fNpl5.jpeg.jpg",
    "alt_text": ""
  },
  "images": [
    {
      "original_url": "https://clubmarevabeirut.com/wp-content/uploads/2024/12/IMG_2940-scaled.jpeg",
      "alt_text": "",
      "local_path": "images/clubmarevabeirut/2024/IMG_2940-scaled.jpeg"
    }
  ],
  "embeds": {
    "youtube": [],
    "instagram": []
  }
}