{
  "id": 4118,
  "title": "Introducing the Club Mareva Beirut Odyssey",
  "slug": "club-mareva-beirut-odyssey",
  "status": "publish",
  "date_created": "2024-05-16T00:08:00",
  "date_modified": "2024-10-04T09:42:33",
  "author": {
    "id": 2,
    "name": "Woody Ghsoubi",
    "login": "wghsoubi"
  },
  "categories": [
    "Events",
    "News"
  ],
  "content": {
    "raw": "<p>An extraordinary collaboration between Club Mareva Beirut and Casdagli Cigars, this cigar is not merely a blend but an invitation to embark on an epic journey through the cosmos.</p>\n<p>The Odyssey features a vitola—the Gran Corona 'A', a revered and traditional Cuban size that is exceedingly rare today. It is meticulously designed to provide at least 2.5 hours of celestial exploration, with dimensions of 47 x 235mm. Crafted with precision at the IGM Boutique Factory in Costa Rica under master blender Jose Gonzalez Ferrer—one of the most gifted agricultural engineers from Cuba—the Odyssey boasts an Ecuadorian Habano wrapper, carefully aged for five years. This exquisite wrapper is harvested from the renowned Oliva plantations in the lush Los Ríos area of Ecuador, a region with a rich tobacco legacy dating back to the 1970s.</p>\n<p>The binder and filler—the heart and soul of the cigar—are composed of tobaccos that have been aged for eight years, their origins shrouded in secrecy to maintain the blend's exclusive allure. As you light the Odyssey, prepare to be transported on a sensory voyage that mirrors the awe-inspiring vastness of space.</p>\n<p><strong>Design and Presentation</strong></p>\n<p>The box itself is a gateway to the universe, featuring a captivating design of a smoker riding a cigar through the star-studded void. The Odyssey's dual-band design features a heraldic coat of arms with a two-headed phoenix on the upper band, while the lower black band is inscribed with \"Club Mareva Beirut\" in gold lettering. This imagery promises an adventure as boundless as the cosmos, with each puff revealing complex layers of flavor that are creamy, full-bodied, and smooth in strength.</p>\n<p><strong>Honoring Tradition</strong></p>\n<p>The Odyssey is a celebration of our founders' shared passion for Cuban cigars—a passion that also resonates deeply with Jeremy Casdagli, the visionary behind Casdagli Cigars. As Jeremy himself describes: \"Woody and Najat have their cigar passions rooted in Cuba—something they share with myself. The aged tobaccos chosen had to emanate an aged Cuban cigar: creamy, full-bodied with a smooth and medium strength.\" To honor this tradition, aged tobaccos were selected to emulate the refined taste of a well-aged Cuban cigar, delivering a smoking experience that is both profound and transcendent.</p>\n<p><strong>A Cosmic Journey of Flavor</strong></p>\n<p>Ranked #3 in the Top 10 Cigars of 2024, the Odyssey delivers tasting notes of oak, medium-roast coffee, leather, butter, and cappuccino with subtle hints of rosemary and green capsicum. The pre-light cold draw reveals barnyard, hay, grass, and green tea. Each draw is like discovering a new star system; every note and nuance, a planet to explore. The thick, creamy smoke unfolds beautifully, creating a narrative that draws the smoker deeper into the mysteries of both tobacco and space. The journey is accentuated by the careful construction of the cigar, which ensures a slow, even burn, allowing the aficionado to savor the intricate dance of aromas and tastes.</p>\n<p><strong>The Founders' Vision</strong></p>\n<p>As Woody Ghsoubi reflects: \"Each leaf was perfectly aged and blended. This cigar symbolizes the infinite journey of discovery and excellence.\" Najat Abdo adds: \"The Odyssey represents not only our passion for cigars but also the professional journey we've undertaken to establish the Club Mareva Beirut brand. Working with Jeremy Casdagli and Marko Bilic has allowed us to create something truly special.\"</p>\n<p><strong>Limited Edition</strong></p>\n<p>This cigar is more than a smoke; it's a passage through time and space, echoing the voyages of the great explorers of old, now reborn in the modern age of exploration through the art of cigar making. With only 200 numbered boxes of 15 cigars each produced—every box hand-signed by founders Najat Abdo and Woody Ghsoubi—the Club Mareva Beirut Odyssey is exceedingly rare.</p>\n<p>It invites you to pause, reflect, and voyage through a galaxy of sensory delights, making every smoker an astronaut of flavor on a mission to uncover the boundless complexities of tobacco—an odyssey of taste, tradition, and time.</p>",
    "clean": "<p>An extraordinary collaboration between Club Mareva Beirut and Casdagli Cigars, this cigar is not merely a blend but an invitation to embark on an epic journey through the cosmos.</p>\n<p>The Odyssey features a vitola—the Gran Corona 'A', a revered and traditional Cuban size that is exceedingly rare today. It is meticulously designed to provide at least 2.5 hours of celestial exploration, with dimensions of 47 x 235mm. Crafted with precision at the IGM Boutique Factory in Costa Rica under master blender Jose Gonzalez Ferrer—one of the most gifted agricultural engineers from Cuba—the Odyssey boasts an Ecuadorian Habano wrapper, carefully aged for five years. This exquisite wrapper is harvested from the renowned Oliva plantations in the lush Los Ríos area of Ecuador, a region with a rich tobacco legacy dating back to the 1970s.</p>\n<p>The binder and filler—the heart and soul of the cigar—are composed of tobaccos that have been aged for eight years, their origins shrouded in secrecy to maintain the blend's exclusive allure. As you light the Odyssey, prepare to be transported on a sensory voyage that mirrors the awe-inspiring vastness of space.</p>\n<p><strong>Design and Presentation</strong></p>\n<p>The box itself is a gateway to the universe, featuring a captivating design of a smoker riding a cigar through the star-studded void. The Odyssey's dual-band design features a heraldic coat of arms with a two-headed phoenix on the upper band, while the lower black band is inscribed with \"Club Mareva Beirut\" in gold lettering. This imagery promises an adventure as boundless as the cosmos, with each puff revealing complex layers of flavor that are creamy, full-bodied, and smooth in strength.</p>\n<p><strong>Honoring Tradition</strong></p>\n<p>The Odyssey is a celebration of our founders' shared passion for Cuban cigars—a passion that also resonates deeply with Jeremy Casdagli, the visionary behind Casdagli Cigars. As Jeremy himself describes: \"Woody and Najat have their cigar passions rooted in Cuba—something they share with myself. The aged tobaccos chosen had to emanate an aged Cuban cigar: creamy, full-bodied with a smooth and medium strength.\" To honor this tradition, aged tobaccos were selected to emulate the refined taste of a well-aged Cuban cigar, delivering a smoking experience that is both profound and transcendent.</p>\n<p><strong>A Cosmic Journey of Flavor</strong></p>\n<p>Ranked #3 in the Top 10 Cigars of 2024, the Odyssey delivers tasting notes of oak, medium-roast coffee, leather, butter, and cappuccino with subtle hints of rosemary and green capsicum. The pre-light cold draw reveals barnyard, hay, grass, and green tea. Each draw is like discovering a new star system; every note and nuance, a planet to explore. The thick, creamy smoke unfolds beautifully, creating a narrative that draws the smoker deeper into the mysteries of both tobacco and space. The journey is accentuated by the careful construction of the cigar, which ensures a slow, even burn, allowing the aficionado to savor the intricate dance of aromas and tastes.</p>\n<p><strong>The Founders' Vision</strong></p>\n<p>As Woody Ghsoubi reflects: \"Each leaf was perfectly aged and blended. This cigar symbolizes the infinite journey of discovery and excellence.\" Najat Abdo adds: \"The Odyssey represents not only our passion for cigars but also the professional journey we've undertaken to establish the Club Mareva Beirut brand. Working with Jeremy Casdagli and Marko Bilic has allowed us to create something truly special.\"</p>\n<p><strong>Limited Edition</strong></p>\n<p>This cigar is more than a smoke; it's a passage through time and space, echoing the voyages of the great explorers of old, now reborn in the modern age of exploration through the art of cigar making. With only 200 numbered boxes of 15 cigars each produced—every box hand-signed by founders Najat Abdo and Woody Ghsoubi—the Club Mareva Beirut Odyssey is exceedingly rare.</p>\n<p>It invites you to pause, reflect, and voyage through a galaxy of sensory delights, making every smoker an astronaut of flavor on a mission to uncover the boundless complexities of tobacco—an odyssey of taste, tradition, and time.</p>",
    "text": "An extraordinary collaboration between Club Mareva Beirut and Casdagli Cigars, this cigar is not merely a blend but an invitation to embark on an epic journey through the cosmos. The Odyssey features a vitola—the Gran Corona 'A', a revered and traditional Cuban size that is exceedingly rare today. It is meticulously designed to provide at least 2.5 hours of celestial exploration, with dimensions of 47 x 235mm. Crafted with precision at the IGM Boutique Factory in Costa Rica under master blender Jose Gonzalez Ferrer—one of the most gifted agricultural engineers from Cuba—the Odyssey boasts an Ecuadorian Habano wrapper, carefully aged for five years. This exquisite wrapper is harvested from the renowned Oliva plantations in the lush Los Ríos area of Ecuador, a region with a rich tobacco legacy dating back to the 1970s. The binder and filler—the heart and soul of the cigar—are composed of tobaccos that have been aged for eight years, their origins shrouded in secrecy to maintain the blend's exclusive allure. As you light the Odyssey, prepare to be transported on a sensory voyage that mirrors the awe-inspiring vastness of space. Design and Presentation The box itself is a gateway to the universe, featuring a captivating design of a smoker riding a cigar through the star-studded void. The Odyssey's dual-band design features a heraldic coat of arms with a two-headed phoenix on the upper band, while the lower black band is inscribed with \"Club Mareva Beirut\" in gold lettering. This imagery promises an adventure as boundless as the cosmos, with each puff revealing complex layers of flavor that are creamy, full-bodied, and smooth in strength. Honoring Tradition The Odyssey is a celebration of our founders' shared passion for Cuban cigars—a passion that also resonates deeply with Jeremy Casdagli, the visionary behind Casdagli Cigars. As Jeremy himself describes: \"Woody and Najat have their cigar passions rooted in Cuba—something they share with myself. The aged tobaccos chosen had to emanate an aged Cuban cigar: creamy, full-bodied with a smooth and medium strength.\" To honor this tradition, aged tobaccos were selected to emulate the refined taste of a well-aged Cuban cigar, delivering a smoking experience that is both profound and transcendent. A Cosmic Journey of Flavor Ranked #3 in the Top 10 Cigars of 2024, the Odyssey delivers tasting notes of oak, medium-roast coffee, leather, butter, and cappuccino with subtle hints of rosemary and green capsicum. The pre-light cold draw reveals barnyard, hay, grass, and green tea. Each draw is like discovering a new star system; every note and nuance, a planet to explore. The thick, creamy smoke unfolds beautifully, creating a narrative that draws the smoker deeper into the mysteries of both tobacco and space. The journey is accentuated by the careful construction of the cigar, which ensures a slow, even burn, allowing the aficionado to savor the intricate dance of aromas and tastes. The Founders' Vision As Woody Ghsoubi reflects: \"Each leaf was perfectly aged and blended. This cigar symbolizes the infinite journey of discovery and excellence.\" Najat Abdo adds: \"The Odyssey represents not only our passion for cigars but also the professional journey we've undertaken to establish the Club Mareva Beirut brand. Working with Jeremy Casdagli and Marko Bilic has allowed us to create something truly special.\" Limited Edition This cigar is more than a smoke; it's a passage through time and space, echoing the voyages of the great explorers of old, now reborn in the modern age of exploration through the art of cigar making. With only 200 numbered boxes of 15 cigars each produced—every box hand-signed by founders Najat Abdo and Woody Ghsoubi—the Club Mareva Beirut Odyssey is exceedingly rare. It invites you to pause, reflect, and voyage through a galaxy of sensory delights, making every smoker an astronaut of flavor on a mission to uncover the boundless complexities of tobacco—an odyssey of taste, tradition, and time."
  },
  "featured_image": {
    "original_url": "https://clubmarevabeirut.com/wp-content/uploads/2024/05/JKP_4852-Edit-2-scaled.jpeg",
    "local_path": "images/clubmarevabeirut/2024/JKP_4852-Edit-2-scaled.jpeg",
    "alt_text": "Club Mareva Beirut Odyssey cigars in their wooden box"
  },
  "images": [
    {
      "original_url": "https://clubmarevabeirut.com/wp-content/uploads/2024/05/3-800x1056.jpeg",
      "alt_text": "The Odyssey cigar against a cosmic nebula backdrop",
      "local_path": "images/clubmarevabeirut/2024/3-800x1056.jpeg"
    },
    {
      "original_url": "https://casdaglicigars.com/wp-content/uploads/2024/08/Odyssey-Exclusive-Lebanon-e1722852311536.jpeg",
      "alt_text": "Odyssey box art featuring a smoker riding a cigar through space with three Gran Corona cigars",
      "local_path": "images/clubmarevabeirut/2024/odyssey-casdagli-product.jpeg"
    }
  ],
  "embeds": {
    "youtube": [],
    "instagram": []
  }
}
