{
  "id": 4066,
  "title": "A Tasting of Glenfarclas Family Casks: Savoring Every Sip at Club Mareva Beirut",
  "slug": "a-tasting-of-glenfarclas-family-casks-savoring-every-sip-at-club-mareva-beirut",
  "status": "publish",
  "date_created": "2023-11-09T19:30:42",
  "date_modified": "2023-11-10T20:17:13",
  "author": {
    "id": 2,
    "name": "Woody Ghsoubi",
    "login": "wghsoubi"
  },
  "categories": [
    "Events",
    "Mareva Malt Mavericks Tastings"
  ],
  "content": {
    "raw": "Our latest event at Club Mareva Beirut was a heartfelt ode to the craftsmanship of Glenfarclas, a distillery renowned for its exceptional single malt whiskies. It was an intimate affair, with just ten whisky enthusiasts gathered to delve into the depths of the Glenfarclas Family Casks—a series that captures the essence of time and tradition.\n\nKenny Abi Chedid, our knowledgeable host, navigated us through the nuances of three distinct Glenfarclas vintages, each with a story to tell.\n\n<strong>The 2003 Vintage - A Fourth Fill Butt Odyssey</strong>\nThe 2003 Family Cask started our journey, a whisky that whispered tales of oak with each sip. Its maturation in a fourth fill butt had lent it a subtlety, a gentle embrace of woodiness with whispers of spices and dried fruits. It was a testament to the beauty of patience, revealing how time can refine and mellow the spirit's vigor.\n\n<strong>The 2005 Vintage - A Refill Butt's Refined Elegance</strong>\nNext was the 2005 cask, aged in a refill butt that allowed the original character of the whisky to shine through. This pour was all about balance, with the cask's previous occupants contributing just the right amount of influence. Vanilla notes played with hints of almond and apple, creating a delightful dance on the palate—a balance that only the passage of years can perfect.\n\n<strong>The 2008 Vintage - The Richness of a Sherry Butt</strong>\nThe finale was the 2008 Family Cask, drawn from a sherry butt that bestowed upon it a richness and complexity that captivated us all. This whisky was bold, with the sherry wood imparting luscious notes of dark chocolate, cherries, and a spicy warmth that lingered long after the last drop was sipped.\n\nAs we moved from bottle to bottle, the conversation flowed. We shared impressions, discussed the evolving landscape of whisky-making, and appreciated how each bottle had something new and intriguing to offer.\n\nThough the event has passed, the essence of it lives on at Club Mareva Beirut. The remaining bottles from our Glenfarclas tasting stand proudly at our bar, a beacon for those who appreciate fine whisky to come and experience the magic themselves.\n\nWe invite you to join us, whether you're a seasoned whisky drinker or new to the scene. There's a Glenfarclas Family Cask here that will catch your fancy, and a seat at Club Mareva Beirut where stories and spirits pour in equal measure.",
    "clean": "Our latest event at Club Mareva Beirut was a heartfelt ode to the craftsmanship of Glenfarclas, a distillery renowned for its exceptional single malt whiskies. It was an intimate affair, with just ten whisky enthusiasts gathered to delve into the depths of the Glenfarclas Family Casks—a series that captures the essence of time and tradition.\n\nKenny Abi Chedid, our knowledgeable host, navigated us through the nuances of three distinct Glenfarclas vintages, each with a story to tell.\n\n<strong>The 2003 Vintage - A Fourth Fill Butt Odyssey</strong>\nThe 2003 Family Cask started our journey, a whisky that whispered tales of oak with each sip. Its maturation in a fourth fill butt had lent it a subtlety, a gentle embrace of woodiness with whispers of spices and dried fruits. It was a testament to the beauty of patience, revealing how time can refine and mellow the spirit's vigor.\n\n<strong>The 2005 Vintage - A Refill Butt's Refined Elegance</strong>\nNext was the 2005 cask, aged in a refill butt that allowed the original character of the whisky to shine through. This pour was all about balance, with the cask's previous occupants contributing just the right amount of influence. Vanilla notes played with hints of almond and apple, creating a delightful dance on the palate—a balance that only the passage of years can perfect.\n\n<strong>The 2008 Vintage - The Richness of a Sherry Butt</strong>\nThe finale was the 2008 Family Cask, drawn from a sherry butt that bestowed upon it a richness and complexity that captivated us all. This whisky was bold, with the sherry wood imparting luscious notes of dark chocolate, cherries, and a spicy warmth that lingered long after the last drop was sipped.\n\nAs we moved from bottle to bottle, the conversation flowed. We shared impressions, discussed the evolving landscape of whisky-making, and appreciated how each bottle had something new and intriguing to offer.\n\nThough the event has passed, the essence of it lives on at Club Mareva Beirut. The remaining bottles from our Glenfarclas tasting stand proudly at our bar, a beacon for those who appreciate fine whisky to come and experience the magic themselves.\n\nWe invite you to join us, whether you're a seasoned whisky drinker or new to the scene. There's a Glenfarclas Family Cask here that will catch your fancy, and a seat at Club Mareva Beirut where stories and spirits pour in equal measure.",
    "text": "Our latest event at Club Mareva Beirut was a heartfelt ode to the craftsmanship of Glenfarclas, a distillery renowned for its exceptional single malt whiskies. It was an intimate affair, with just ten whisky enthusiasts gathered to delve into the depths of the Glenfarclas Family Casks—a series that captures the essence of time and tradition. Kenny Abi Chedid, our knowledgeable host, navigated us through the nuances of three distinct Glenfarclas vintages, each with a story to tell. The 2003 Vintage - A Fourth Fill Butt Odyssey The 2003 Family Cask started our journey, a whisky that whispered tales of oak with each sip. Its maturation in a fourth fill butt had lent it a subtlety, a gentle embrace of woodiness with whispers of spices and dried fruits. It was a testament to the beauty of patience, revealing how time can refine and mellow the spirit's vigor. The 2005 Vintage - A Refill Butt's Refined Elegance Next was the 2005 cask, aged in a refill butt that allowed the original character of the whisky to shine through. This pour was all about balance, with the cask's previous occupants contributing just the right amount of influence. Vanilla notes played with hints of almond and apple, creating a delightful dance on the palate—a balance that only the passage of years can perfect. The 2008 Vintage - The Richness of a Sherry Butt The finale was the 2008 Family Cask, drawn from a sherry butt that bestowed upon it a richness and complexity that captivated us all. This whisky was bold, with the sherry wood imparting luscious notes of dark chocolate, cherries, and a spicy warmth that lingered long after the last drop was sipped. As we moved from bottle to bottle, the conversation flowed. We shared impressions, discussed the evolving landscape of whisky-making, and appreciated how each bottle had something new and intriguing to offer. Though the event has passed, the essence of it lives on at Club Mareva Beirut. The remaining bottles from our Glenfarclas tasting stand proudly at our bar, a beacon for those who appreciate fine whisky to come and experience the magic themselves. We invite you to join us, whether you're a seasoned whisky drinker or new to the scene. There's a Glenfarclas Family Cask here that will catch your fancy, and a seat at Club Mareva Beirut where stories and spirits pour in equal measure."
  },
  "featured_image": {
    "original_url": "https://clubmarevabeirut.com/wp-content/uploads/2023/11/BDA813A7-8679-456F-8E0A-3FD16A317E61_1_102_a.jpeg",
    "local_path": "images/clubmarevabeirut/2023/BDA813A7-8679-456F-8E0A-3FD16A317E61_1_102_a.jpeg",
    "alt_text": "Glenfarclas Sherry Cask Tasting"
  },
  "images": [],
  "embeds": {
    "youtube": [],
    "instagram": []
  }
}