{
  "id": 4046,
  "title": "Meikle Tòir Tasting Night at Club Mareva Beirut",
  "slug": "a-special-whisky-adventure-meikle-toir-tasting-night-at-club-mareva-beirut",
  "status": "publish",
  "date_created": "2023-09-26T19:30:25",
  "date_modified": "2023-10-07T17:12:13",
  "author": {
    "id": 2,
    "name": "Woody Ghsoubi",
    "login": "wghsoubi"
  },
  "categories": [
    "Events",
    "International Events",
    "Mareva Malt Mavericks Tastings"
  ],
  "content": {
    "raw": "<span data-tt=\"{&quot;paragraphStyle&quot;:{&quot;alignment&quot;:4,&quot;writingDirection&quot;:1}}\">At Club Mareva Beirut, friendship and the love of discovery come together to make lasting memories for whisky lovers. On a calm evening, our respected tasting group, the Mareva Malt Mavericks, came together to enjoy the fine taste of Meikle Tòir whiskies. Fifteen eager participants gathered, ready to experience the skilled creation of well-known Master Distiller, Billy Walker. </span>\n\nThe Glenallachie distillery, under the guidance of renowned whiskey expert Billy Walker, has introduced a line of peated Speyside single malt whiskeys using the Meikle Tòir label. This venture into peated spirits has been a small-scale endeavor for the distillery since 2018, with roughly 100,000 liters of peated raw spirit distilled over a brief six-week period each year.\n\nTo create this distinctive peated character, the barley malt was dried using mainland peat sourced from St. Fergus. This choice of peat, as opposed to island peat, imparts a sweeter smokiness with subtle oak undertones. Notably, the peat is utilized in a wet state, maximizing the aromatic potential and resulting in a current peat content of up to 71 ppm (compared to up to 95 ppm in barley malt).\n\nThis meticulous process has yielded four exceptional, smoky single malts, each of which has developed its unique flavor profile through various aging processes. The flagship expression, known as \"The Original,\" has matured in a combination of bourbon and rye barrels, as well as American Virgin Oak. \"Meikle Tòir – The Chinquapin One\" finds its home in fresh oak barrels from Missouri, among other cask types. Meanwhile, \"The Sherry One\" has been patiently aged in Pedro Ximénez and Oloroso Sherry Puncheons. For many whiskey enthusiasts and collectors, the standout is \"The Turbo 2023,\" a sought-after release that has become scarce in many locations. This particular whiskey has matured in three Virgin Oak Casks and five Oloroso Sherry Hogsheads.\n\nAll four whiskeys proudly display their natural hues and are free from the need for chill filtration.\n<h3>Meikle Tòir 5 Years The Turbo 2023 Release</h3>\nThis 5-year-old expression of Meikle Tòir, known as The Turbo 2023, has been bottled at a robust 50.0 percent alcohol by volume, featuring a peat content of 71 ppm.\n\nOn the Nose: The whiskey opens with inviting notes of manuka honey, complemented by subtle hints of weathered leather and decadent chocolate. As you delve deeper, roasted hazelnuts emerge, leading to nuances of dried sultanas and the zest of burnt orange peel.\n\nTasting: The Meikle Tòir The Turbo 2023 delivers an intense peat experience on the palate, accompanied by flavors of mocha and heather honey, underscored by a background of smoked spices.\n\nFinish: This 5-year-old Speyside whiskey bids farewell with the comforting warmth of roasted chestnuts and leaves behind a gentle trace of charred oak after each sip.\n<h3>Meikle Tòir 5 Years The Original</h3>\nThe 5-year-old Meikle Tòir, known as The Original, has been bottled at 50.0 percent alcohol by volume, with a peat content of 35 ppm.\n\nNosing: The whiskey graces the nose with delightful aromas of baking spices and caramelized honey, intertwined with the alluring scents of roasted coffee beans and toasted hazelnuts. Subtle undertones of smoked almonds and butterscotch complete the bouquet.\n\nTasting: On the palate, The Meikle Tòir The Original offers sweetness, featuring pronounced notes of peat and intense chocolate, complemented by the gentle embrace of heather honey and a touch of cinnamon, further enhanced by the zest of ginger.\n\nFinish: This 5-year-old Speyside whiskey concludes its journey with the lingering essence of oak smoke and a faint hint of smoked sugar.\n<h3>Meikle Tòir 5 Years The Sherry One</h3>\nThe 5-year-old Meikle Tòir, known as The Sherry One, has been bottled at 48.0 percent alcohol by volume, with a peat content of 35 ppm.\n\nNosing: This whiskey fills the senses with the rich aroma of cedarwood and the evocative presence of a cigar box. Subsequent notes of butterscotch, mocha, and zesty orange peel emerge, with a delicate touch of honey and plum jam to round off the aromatic experience.\n\nTasting: On the palate, The Meikle Tòir The Sherry One introduces the palate to dark chocolate, smoked honey, and mocha flavors, accompanied by hints of fig and beet syrup.\n\nFinish: The 5-year-old Speyside whiskey bids adieu with the lingering essence of burnt sugar and the persistent embrace of peat smoke.\n<h3>Meikle Tòir 5 Years The Chinquapin One</h3>\nThe 5-year-old Meikle Tòir, known as The Chinquapin One, has been bottled at 48.0 percent alcohol by volume, with a peat content of 35 ppm.\n\nNosing: This whiskey envelops the senses with the allure of smoldering oak embers, accompanied by notes of burnt licorice and honeycomb. In the background, wild heather and spicy ginger make their presence felt, while butterscotch and orange peel add a harmonious touch.\n\nTasting: On the palate, The Meikle Tòir The Chinquapin One offers a creamy texture and flavors of dark chocolate and crème brûlée, complemented by roasted almonds and a hint of cinnamon. The tasting journey is initiated by the inviting presence of brittle.\n\nFinish: This 5-year-old Speyside whiskey takes its leave with lingering notes of anise and the distant echoes of a campfire's smoke.",
    "clean": "<span data-tt=\"{&quot;paragraphStyle&quot;:{&quot;alignment&quot;:4,&quot;writingDirection&quot;:1}}\">At Club Mareva Beirut, friendship and the love of discovery come together to make lasting memories for whisky lovers. On a calm evening, our respected tasting group, the Mareva Malt Mavericks, came together to enjoy the fine taste of Meikle Tòir whiskies. Fifteen eager participants gathered, ready to experience the skilled creation of well-known Master Distiller, Billy Walker. </span>\n\nThe Glenallachie distillery, under the guidance of renowned whiskey expert Billy Walker, has introduced a line of peated Speyside single malt whiskeys using the Meikle Tòir label. This venture into peated spirits has been a small-scale endeavor for the distillery since 2018, with roughly 100,000 liters of peated raw spirit distilled over a brief six-week period each year.\n\nTo create this distinctive peated character, the barley malt was dried using mainland peat sourced from St. Fergus. This choice of peat, as opposed to island peat, imparts a sweeter smokiness with subtle oak undertones. Notably, the peat is utilized in a wet state, maximizing the aromatic potential and resulting in a current peat content of up to 71 ppm (compared to up to 95 ppm in barley malt).\n\nThis meticulous process has yielded four exceptional, smoky single malts, each of which has developed its unique flavor profile through various aging processes. The flagship expression, known as \"The Original,\" has matured in a combination of bourbon and rye barrels, as well as American Virgin Oak. \"Meikle Tòir – The Chinquapin One\" finds its home in fresh oak barrels from Missouri, among other cask types. Meanwhile, \"The Sherry One\" has been patiently aged in Pedro Ximénez and Oloroso Sherry Puncheons. For many whiskey enthusiasts and collectors, the standout is \"The Turbo 2023,\" a sought-after release that has become scarce in many locations. This particular whiskey has matured in three Virgin Oak Casks and five Oloroso Sherry Hogsheads.\n\nAll four whiskeys proudly display their natural hues and are free from the need for chill filtration.\n<h3>Meikle Tòir 5 Years The Turbo 2023 Release</h3>\nThis 5-year-old expression of Meikle Tòir, known as The Turbo 2023, has been bottled at a robust 50.0 percent alcohol by volume, featuring a peat content of 71 ppm.\n\nOn the Nose: The whiskey opens with inviting notes of manuka honey, complemented by subtle hints of weathered leather and decadent chocolate. As you delve deeper, roasted hazelnuts emerge, leading to nuances of dried sultanas and the zest of burnt orange peel.\n\nTasting: The Meikle Tòir The Turbo 2023 delivers an intense peat experience on the palate, accompanied by flavors of mocha and heather honey, underscored by a background of smoked spices.\n\nFinish: This 5-year-old Speyside whiskey bids farewell with the comforting warmth of roasted chestnuts and leaves behind a gentle trace of charred oak after each sip.\n<h3>Meikle Tòir 5 Years The Original</h3>\nThe 5-year-old Meikle Tòir, known as The Original, has been bottled at 50.0 percent alcohol by volume, with a peat content of 35 ppm.\n\nNosing: The whiskey graces the nose with delightful aromas of baking spices and caramelized honey, intertwined with the alluring scents of roasted coffee beans and toasted hazelnuts. Subtle undertones of smoked almonds and butterscotch complete the bouquet.\n\nTasting: On the palate, The Meikle Tòir The Original offers sweetness, featuring pronounced notes of peat and intense chocolate, complemented by the gentle embrace of heather honey and a touch of cinnamon, further enhanced by the zest of ginger.\n\nFinish: This 5-year-old Speyside whiskey concludes its journey with the lingering essence of oak smoke and a faint hint of smoked sugar.\n<h3>Meikle Tòir 5 Years The Sherry One</h3>\nThe 5-year-old Meikle Tòir, known as The Sherry One, has been bottled at 48.0 percent alcohol by volume, with a peat content of 35 ppm.\n\nNosing: This whiskey fills the senses with the rich aroma of cedarwood and the evocative presence of a cigar box. Subsequent notes of butterscotch, mocha, and zesty orange peel emerge, with a delicate touch of honey and plum jam to round off the aromatic experience.\n\nTasting: On the palate, The Meikle Tòir The Sherry One introduces the palate to dark chocolate, smoked honey, and mocha flavors, accompanied by hints of fig and beet syrup.\n\nFinish: The 5-year-old Speyside whiskey bids adieu with the lingering essence of burnt sugar and the persistent embrace of peat smoke.\n<h3>Meikle Tòir 5 Years The Chinquapin One</h3>\nThe 5-year-old Meikle Tòir, known as The Chinquapin One, has been bottled at 48.0 percent alcohol by volume, with a peat content of 35 ppm.\n\nNosing: This whiskey envelops the senses with the allure of smoldering oak embers, accompanied by notes of burnt licorice and honeycomb. In the background, wild heather and spicy ginger make their presence felt, while butterscotch and orange peel add a harmonious touch.\n\nTasting: On the palate, The Meikle Tòir The Chinquapin One offers a creamy texture and flavors of dark chocolate and crème brûlée, complemented by roasted almonds and a hint of cinnamon. The tasting journey is initiated by the inviting presence of brittle.\n\nFinish: This 5-year-old Speyside whiskey takes its leave with lingering notes of anise and the distant echoes of a campfire's smoke.",
    "text": "At Club Mareva Beirut, friendship and the love of discovery come together to make lasting memories for whisky lovers. On a calm evening, our respected tasting group, the Mareva Malt Mavericks, came together to enjoy the fine taste of Meikle Tòir whiskies. Fifteen eager participants gathered, ready to experience the skilled creation of well-known Master Distiller, Billy Walker. The Glenallachie distillery, under the guidance of renowned whiskey expert Billy Walker, has introduced a line of peated Speyside single malt whiskeys using the Meikle Tòir label. This venture into peated spirits has been a small-scale endeavor for the distillery since 2018, with roughly 100,000 liters of peated raw spirit distilled over a brief six-week period each year. To create this distinctive peated character, the barley malt was dried using mainland peat sourced from St. Fergus. This choice of peat, as opposed to island peat, imparts a sweeter smokiness with subtle oak undertones. Notably, the peat is utilized in a wet state, maximizing the aromatic potential and resulting in a current peat content of up to 71 ppm (compared to up to 95 ppm in barley malt). This meticulous process has yielded four exceptional, smoky single malts, each of which has developed its unique flavor profile through various aging processes. The flagship expression, known as \"The Original,\" has matured in a combination of bourbon and rye barrels, as well as American Virgin Oak. \"Meikle Tòir – The Chinquapin One\" finds its home in fresh oak barrels from Missouri, among other cask types. Meanwhile, \"The Sherry One\" has been patiently aged in Pedro Ximénez and Oloroso Sherry Puncheons. For many whiskey enthusiasts and collectors, the standout is \"The Turbo 2023,\" a sought-after release that has become scarce in many locations. This particular whiskey has matured in three Virgin Oak Casks and five Oloroso Sherry Hogsheads. All four whiskeys proudly display their natural hues and are free from the need for chill filtration. Meikle Tòir 5 Years The Turbo 2023 Release This 5-year-old expression of Meikle Tòir, known as The Turbo 2023, has been bottled at a robust 50.0 percent alcohol by volume, featuring a peat content of 71 ppm. On the Nose: The whiskey opens with inviting notes of manuka honey, complemented by subtle hints of weathered leather and decadent chocolate. As you delve deeper, roasted hazelnuts emerge, leading to nuances of dried sultanas and the zest of burnt orange peel. Tasting: The Meikle Tòir The Turbo 2023 delivers an intense peat experience on the palate, accompanied by flavors of mocha and heather honey, underscored by a background of smoked spices. Finish: This 5-year-old Speyside whiskey bids farewell with the comforting warmth of roasted chestnuts and leaves behind a gentle trace of charred oak after each sip. Meikle Tòir 5 Years The Original The 5-year-old Meikle Tòir, known as The Original, has been bottled at 50.0 percent alcohol by volume, with a peat content of 35 ppm. Nosing: The whiskey graces the nose with delightful aromas of baking spices and caramelized honey, intertwined with the alluring scents of roasted coffee beans and toasted hazelnuts. Subtle undertones of smoked almonds and butterscotch complete the bouquet. Tasting: On the palate, The Meikle Tòir The Original offers sweetness, featuring pronounced notes of peat and intense chocolate, complemented by the gentle embrace of heather honey and a touch of cinnamon, further enhanced by the zest of ginger. Finish: This 5-year-old Speyside whiskey concludes its journey with the lingering essence of oak smoke and a faint hint of smoked sugar. Meikle Tòir 5 Years The Sherry One The 5-year-old Meikle Tòir, known as The Sherry One, has been bottled at 48.0 percent alcohol by volume, with a peat content of 35 ppm. Nosing: This whiskey fills the senses with the rich aroma of cedarwood and the evocative presence of a cigar box. Subsequent notes of butterscotch, mocha, and zesty orange peel emerge, with a delicate touch of honey and plum jam to round off the aromatic experience. Tasting: On the palate, The Meikle Tòir The Sherry One introduces the palate to dark chocolate, smoked honey, and mocha flavors, accompanied by hints of fig and beet syrup. Finish: The 5-year-old Speyside whiskey bids adieu with the lingering essence of burnt sugar and the persistent embrace of peat smoke. Meikle Tòir 5 Years The Chinquapin One The 5-year-old Meikle Tòir, known as The Chinquapin One, has been bottled at 48.0 percent alcohol by volume, with a peat content of 35 ppm. Nosing: This whiskey envelops the senses with the allure of smoldering oak embers, accompanied by notes of burnt licorice and honeycomb. In the background, wild heather and spicy ginger make their presence felt, while butterscotch and orange peel add a harmonious touch. Tasting: On the palate, The Meikle Tòir The Chinquapin One offers a creamy texture and flavors of dark chocolate and crème brûlée, complemented by roasted almonds and a hint of cinnamon. The tasting journey is initiated by the inviting presence of brittle. Finish: This 5-year-old Speyside whiskey takes its leave with lingering notes of anise and the distant echoes of a campfire's smoke."
  },
  "featured_image": {
    "original_url": "https://clubmarevabeirut.com/wp-content/uploads/2023/10/918069B4-590C-4504-B738-4A028369860E_1_201_a-scaled.jpeg",
    "local_path": "images/clubmarevabeirut/2023/918069B4-590C-4504-B738-4A028369860E_1_201_a-scaled.jpeg",
    "alt_text": "Meikle Toir Whisky"
  },
  "images": [],
  "embeds": {
    "youtube": [],
    "instagram": []
  }
}