{
  "id": 4038,
  "title": "Drew Estate Introduces “Liga Privada 10 Selección de Mercado” Exclusively for Club Mareva Beirut for the Middle East market",
  "slug": "drew-estate-introduces-liga-privada-10-seleccion-de-mercado-exclusively-for-club-mareva-beirut-for-the-middle-east-market",
  "status": "publish",
  "date_created": "2023-09-26T13:17:54",
  "date_modified": "2023-09-26T13:17:54",
  "author": {
    "id": 2,
    "name": "Woody Ghsoubi",
    "login": "wghsoubi"
  },
  "categories": [
    "News"
  ],
  "content": {
    "raw": "Available only to international markets, Liga Privada 10 Selección de Mercado (6 x 52 Toro) is handcrafted to highlight the bold characteristics of a specially curated Connecticut Criollo capa leaf that’s grown exclusively for Drew Estate by one farmer in the famed Connecticut River Valley. The cigar’s name is Spanish for “Market Selection,” and is inspired by the old practice of selecting wrapper leaves for certain national markets by color. Drew Estate chose only the most beautiful <em>rosado</em> Connecticut Criollo leaves to grace Selección de Mercado.\n\n&nbsp;\n\n“Selección de Mercado is Drew’s first truly global brand drop,” says Drew Estate Founder and President, Jonathan Drew. “Liga Privada is notoriously bold, dense, hearty, earthy and robust ... true to the Connecticut River Valley. Seleccion de Mercado is different!!! It’s an experience of Liga Privada that’s truly unexpected, with the international cigar smoker at the forefront of our mind throughout our creative stages of development. The Selección de Mercado blend is like, ‘Yo homie, I didn’t think anybody could get a smoke like this in a cigar that’s not Cuban, but this Liga Privada nails it. That’s wild.”\n\n&nbsp;\n\nWhile maintaining an overall robust character, Selección de Mercado delights connoisseurs with its medium-body. The <em>rosado</em> capa surrounds a blend of Mexican capote and tripa tobaccos from Nicaragua and Pennsylvania to create a cigar that is deeply balanced, bold and sophisticated, with luxurious espresso notes that complement the Connecticut Criollo’s earthiness. With an unfinished foot and the <em>Cola de Pescado </em>(fishtail) head, Selección de Mercado is made by the same buncheros and rolleras who role Liga Privada 10 Aniversario and will be available in 10-count boxes.\n\n&nbsp;\n\n<strong>About Drew Estate\n</strong>Founded in 1996 in the DUMBO neighborhood of Brooklyn, New York, Drew Estate has single-handedly defined modern day cigar culture through a hard-hitting, authentic, bottom-up approach to lifestyle branding and culture building. Our mission and manifesto is “The Rebirth of Cigars,” which we amplify through our uncanny authenticity and high energy. With deeply-loved brands produced from La Gran Fabrica Drew Estate in Estelí, Nicaragua, such as: ACID, 20 Acre Farm, BLACKENED Cigars, Deadwood, Factory Smokes, Herrera Estelí, Isla del Sol, Kentucky Fire Cured, Liga Privada, Nica Rustica, Pappy Van Winkle Barrel Fermented Cigars, Tabak Especial and Undercrown; and the celebrated Barn Smoker, Cigar Safari and Freestyle Live experiential events, Drew Estate appeals to the entire premium cigar sector and beyond. Learn more about our story and our brands by visiting <a href=\"https://www.drewestate.com\">Drew Estate</a>.\n\n<img class=\"aligncenter size-fusion600 wp-image-4040\" src=\"https://clubmarevabeirut.com/wp-content/uploads/2023/09/Liga_Privada_10_SdM_1080_A.jpg\" alt=\"\" width=\"1080\" height=\"1080\" /> <img class=\"aligncenter size-fusion600 wp-image-4041\" src=\"https://clubmarevabeirut.com/wp-content/uploads/2023/09/Liga_Privada_10_SdM_1080_B.jpg\" alt=\"\" width=\"1080\" height=\"1080\" />",
    "clean": "Available only to international markets, Liga Privada 10 Selección de Mercado (6 x 52 Toro) is handcrafted to highlight the bold characteristics of a specially curated Connecticut Criollo capa leaf that’s grown exclusively for Drew Estate by one farmer in the famed Connecticut River Valley. The cigar’s name is Spanish for “Market Selection,” and is inspired by the old practice of selecting wrapper leaves for certain national markets by color. Drew Estate chose only the most beautiful <em>rosado</em> Connecticut Criollo leaves to grace Selección de Mercado.\n\n&nbsp;\n\n“Selección de Mercado is Drew’s first truly global brand drop,” says Drew Estate Founder and President, Jonathan Drew. “Liga Privada is notoriously bold, dense, hearty, earthy and robust ... true to the Connecticut River Valley. Seleccion de Mercado is different!!! It’s an experience of Liga Privada that’s truly unexpected, with the international cigar smoker at the forefront of our mind throughout our creative stages of development. The Selección de Mercado blend is like, ‘Yo homie, I didn’t think anybody could get a smoke like this in a cigar that’s not Cuban, but this Liga Privada nails it. That’s wild.”\n\n&nbsp;\n\nWhile maintaining an overall robust character, Selección de Mercado delights connoisseurs with its medium-body. The <em>rosado</em> capa surrounds a blend of Mexican capote and tripa tobaccos from Nicaragua and Pennsylvania to create a cigar that is deeply balanced, bold and sophisticated, with luxurious espresso notes that complement the Connecticut Criollo’s earthiness. With an unfinished foot and the <em>Cola de Pescado </em>(fishtail) head, Selección de Mercado is made by the same buncheros and rolleras who role Liga Privada 10 Aniversario and will be available in 10-count boxes.\n\n&nbsp;\n\n<strong>About Drew Estate\n</strong>Founded in 1996 in the DUMBO neighborhood of Brooklyn, New York, Drew Estate has single-handedly defined modern day cigar culture through a hard-hitting, authentic, bottom-up approach to lifestyle branding and culture building. Our mission and manifesto is “The Rebirth of Cigars,” which we amplify through our uncanny authenticity and high energy. With deeply-loved brands produced from La Gran Fabrica Drew Estate in Estelí, Nicaragua, such as: ACID, 20 Acre Farm, BLACKENED Cigars, Deadwood, Factory Smokes, Herrera Estelí, Isla del Sol, Kentucky Fire Cured, Liga Privada, Nica Rustica, Pappy Van Winkle Barrel Fermented Cigars, Tabak Especial and Undercrown; and the celebrated Barn Smoker, Cigar Safari and Freestyle Live experiential events, Drew Estate appeals to the entire premium cigar sector and beyond. Learn more about our story and our brands by visiting <a href=\"https://www.drewestate.com\">Drew Estate</a>.\n\n<img class=\"aligncenter size-fusion600 wp-image-4040\" src=\"https://clubmarevabeirut.com/wp-content/uploads/2023/09/Liga_Privada_10_SdM_1080_A.jpg\" alt=\"\" width=\"1080\" height=\"1080\" /> <img class=\"aligncenter size-fusion600 wp-image-4041\" src=\"https://clubmarevabeirut.com/wp-content/uploads/2023/09/Liga_Privada_10_SdM_1080_B.jpg\" alt=\"\" width=\"1080\" height=\"1080\" />",
    "text": "Available only to international markets, Liga Privada 10 Selección de Mercado (6 x 52 Toro) is handcrafted to highlight the bold characteristics of a specially curated Connecticut Criollo capa leaf that’s grown exclusively for Drew Estate by one farmer in the famed Connecticut River Valley. The cigar’s name is Spanish for “Market Selection,” and is inspired by the old practice of selecting wrapper leaves for certain national markets by color. Drew Estate chose only the most beautiful rosado Connecticut Criollo leaves to grace Selección de Mercado. “Selección de Mercado is Drew’s first truly global brand drop,” says Drew Estate Founder and President, Jonathan Drew. “Liga Privada is notoriously bold, dense, hearty, earthy and robust ... true to the Connecticut River Valley. Seleccion de Mercado is different!!! It’s an experience of Liga Privada that’s truly unexpected, with the international cigar smoker at the forefront of our mind throughout our creative stages of development. The Selección de Mercado blend is like, ‘Yo homie, I didn’t think anybody could get a smoke like this in a cigar that’s not Cuban, but this Liga Privada nails it. That’s wild.” While maintaining an overall robust character, Selección de Mercado delights connoisseurs with its medium-body. The rosado capa surrounds a blend of Mexican capote and tripa tobaccos from Nicaragua and Pennsylvania to create a cigar that is deeply balanced, bold and sophisticated, with luxurious espresso notes that complement the Connecticut Criollo’s earthiness. With an unfinished foot and the Cola de Pescado (fishtail) head, Selección de Mercado is made by the same buncheros and rolleras who role Liga Privada 10 Aniversario and will be available in 10-count boxes. About Drew Estate Founded in 1996 in the DUMBO neighborhood of Brooklyn, New York, Drew Estate has single-handedly defined modern day cigar culture through a hard-hitting, authentic, bottom-up approach to lifestyle branding and culture building. Our mission and manifesto is “The Rebirth of Cigars,” which we amplify through our uncanny authenticity and high energy. With deeply-loved brands produced from La Gran Fabrica Drew Estate in Estelí, Nicaragua, such as: ACID, 20 Acre Farm, BLACKENED Cigars, Deadwood, Factory Smokes, Herrera Estelí, Isla del Sol, Kentucky Fire Cured, Liga Privada, Nica Rustica, Pappy Van Winkle Barrel Fermented Cigars, Tabak Especial and Undercrown; and the celebrated Barn Smoker, Cigar Safari and Freestyle Live experiential events, Drew Estate appeals to the entire premium cigar sector and beyond. Learn more about our story and our brands by visiting Drew Estate ."
  },
  "featured_image": {
    "original_url": "https://clubmarevabeirut.com/wp-content/uploads/2023/09/Liga_Privada_10_SdM_1080_C.jpg",
    "local_path": "images/clubmarevabeirut/2023/Liga_Privada_10_SdM_1080_C.jpg",
    "alt_text": ""
  },
  "images": [
    {
      "original_url": "https://clubmarevabeirut.com/wp-content/uploads/2023/09/Liga_Privada_10_SdM_1080_A.jpg",
      "alt_text": "",
      "local_path": "images/clubmarevabeirut/2023/Liga_Privada_10_SdM_1080_A.jpg"
    },
    {
      "original_url": "https://clubmarevabeirut.com/wp-content/uploads/2023/09/Liga_Privada_10_SdM_1080_B.jpg",
      "alt_text": "",
      "local_path": "images/clubmarevabeirut/2023/Liga_Privada_10_SdM_1080_B.jpg"
    }
  ],
  "embeds": {
    "youtube": [],
    "instagram": []
  }
}