{
  "id": 4008,
  "title": "Club Mareva Beirut and \"The Puffing Fez\" Join Forces for a Noble Cause",
  "slug": "club-mareva-beirut-and-the-puffing-fez-join-forces-for-a-noble-cause",
  "status": "publish",
  "date_created": "2023-08-08T18:00:06",
  "date_modified": "2023-08-21T20:49:47",
  "author": {
    "id": 2,
    "name": "Woody Ghsoubi",
    "login": "wghsoubi"
  },
  "categories": [
    "Events",
    "Mareva Malt Mavericks Tastings"
  ],
  "content": {
    "raw": "Club Mareva Beirut recently hosted a thrilling fundraising event with \"The Puffing Fez\" Cigar group, part of Lubnan Shriners, for the wellbeing of children in Lebanon. The night was alive with camaraderie, featuring a pairing of Drew Estate Undercrown Sungrown Toro and Glenfarclas 15. The event was a complete success, and we eagerly anticipate more collaborations.\n<h3>About Lubnan Shriners</h3>\nLubnan Shriners is a dynamic force in Lebanon, representing more than just an organization; it symbolizes a beacon of hope and compassion. Operating with an unwavering commitment, it extends its support across the country, touching lives and nurturing dreams.\n\n<strong>Medical Assistance:</strong> Lubnan Shriners focuses on providing crucial medical aid to children and individuals in need. Whether it's through the renovation and equipment of pediatric clinics or collaborating with Shriners Hospitals for Children across the world, they ensure that those in need receive quality healthcare without financial burden. Their work includes not only treatments and surgeries but also essential follow-up care, enabling full recovery.\n\n<strong>Educational Support:</strong> Education is a core pillar of their mission. Lubnan Shriners believes that every child should have access to quality education, irrespective of their economic background. By providing scholarships, educational materials, and support to schools in underprivileged areas, they help in building a foundation for a brighter future. Their efforts have transformed lives, offering children the chance to pursue their dreams and break free from the cycle of poverty.\n\n<strong>Social Help:</strong> Beyond medical and educational spheres, Lubnan Shriners extends its support in various social aspects. Through community outreach programs, they assist families in distress, provide counseling, and create awareness about various social issues. Their clubs scattered throughout Lebanon actively engage in local communities, focusing on empowerment and upliftment.\n\n<strong>One Bright Smile at a Time:</strong> The true essence of Lubnan Shriners is captured in the smiles they bring to the faces of the children and individuals they help. Each successful treatment, each child attending school, and each family they support adds to the chain of smiles they have created. Their work is a testament to human empathy and the belief that even small acts of kindness can make significant changes.\n\nThrough their dedicated efforts, Lubnan Shriners has become synonymous with hope, love, and care in Lebanon, nurturing a society where everyone has an equal chance to thrive.\n<h3>Spotlight on \"The Puffing Fez\"</h3>\nA fraternity of cigar enthusiasts, \"The Puffing Fez\" is focused on raising funds for pediatric clinics and assisting Lubnan Shriners in sending children for free treatments at Shriners Hospitals worldwide.\n<h3>A Night to Remember</h3>\nThe evening was a fusion of fine cigars and philanthropy. Guests enjoyed exquisite pairings, conversations, and the satisfaction of contributing to a noble cause. The success of the fundraiser ignited hope and built lasting connections.\n<h3>Future Collaborations with \"The Puffing Fez\"</h3>\nOur collaboration with \"The Puffing Fez\" has sparked new excitement, and we are planning further joint ventures to extend our reach and impact.\n<h3>Be Part of the Change</h3>\nJoin us at Club Mareva Beirut in our upcoming events to be part of a community that uses the passion for cigars as a vehicle for change.\n\nThank you for your support, and we look forward to welcoming you again at Club Mareva Beirut, where cigars meet compassion.\n\n&nbsp;\n\n<img class=\"aligncenter size-full wp-image-4011\" src=\"https://clubmarevabeirut.com/wp-content/uploads/2023/08/IMG_4006-scaled.jpeg\" alt=\"\" width=\"2560\" height=\"1920\" />\n\n&nbsp;\n\n<img class=\"aligncenter size-full wp-image-4013\" src=\"https://clubmarevabeirut.com/wp-content/uploads/2023/08/IMG_4003-scaled.jpeg\" alt=\"\" width=\"2560\" height=\"1920\" />",
    "clean": "Club Mareva Beirut recently hosted a thrilling fundraising event with \"The Puffing Fez\" Cigar group, part of Lubnan Shriners, for the wellbeing of children in Lebanon. The night was alive with camaraderie, featuring a pairing of Drew Estate Undercrown Sungrown Toro and Glenfarclas 15. The event was a complete success, and we eagerly anticipate more collaborations.\n<h3>About Lubnan Shriners</h3>\nLubnan Shriners is a dynamic force in Lebanon, representing more than just an organization; it symbolizes a beacon of hope and compassion. Operating with an unwavering commitment, it extends its support across the country, touching lives and nurturing dreams.\n\n<strong>Medical Assistance:</strong> Lubnan Shriners focuses on providing crucial medical aid to children and individuals in need. Whether it's through the renovation and equipment of pediatric clinics or collaborating with Shriners Hospitals for Children across the world, they ensure that those in need receive quality healthcare without financial burden. Their work includes not only treatments and surgeries but also essential follow-up care, enabling full recovery.\n\n<strong>Educational Support:</strong> Education is a core pillar of their mission. Lubnan Shriners believes that every child should have access to quality education, irrespective of their economic background. By providing scholarships, educational materials, and support to schools in underprivileged areas, they help in building a foundation for a brighter future. Their efforts have transformed lives, offering children the chance to pursue their dreams and break free from the cycle of poverty.\n\n<strong>Social Help:</strong> Beyond medical and educational spheres, Lubnan Shriners extends its support in various social aspects. Through community outreach programs, they assist families in distress, provide counseling, and create awareness about various social issues. Their clubs scattered throughout Lebanon actively engage in local communities, focusing on empowerment and upliftment.\n\n<strong>One Bright Smile at a Time:</strong> The true essence of Lubnan Shriners is captured in the smiles they bring to the faces of the children and individuals they help. Each successful treatment, each child attending school, and each family they support adds to the chain of smiles they have created. Their work is a testament to human empathy and the belief that even small acts of kindness can make significant changes.\n\nThrough their dedicated efforts, Lubnan Shriners has become synonymous with hope, love, and care in Lebanon, nurturing a society where everyone has an equal chance to thrive.\n<h3>Spotlight on \"The Puffing Fez\"</h3>\nA fraternity of cigar enthusiasts, \"The Puffing Fez\" is focused on raising funds for pediatric clinics and assisting Lubnan Shriners in sending children for free treatments at Shriners Hospitals worldwide.\n<h3>A Night to Remember</h3>\nThe evening was a fusion of fine cigars and philanthropy. Guests enjoyed exquisite pairings, conversations, and the satisfaction of contributing to a noble cause. The success of the fundraiser ignited hope and built lasting connections.\n<h3>Future Collaborations with \"The Puffing Fez\"</h3>\nOur collaboration with \"The Puffing Fez\" has sparked new excitement, and we are planning further joint ventures to extend our reach and impact.\n<h3>Be Part of the Change</h3>\nJoin us at Club Mareva Beirut in our upcoming events to be part of a community that uses the passion for cigars as a vehicle for change.\n\nThank you for your support, and we look forward to welcoming you again at Club Mareva Beirut, where cigars meet compassion.\n\n&nbsp;\n\n<img class=\"aligncenter size-full wp-image-4011\" src=\"https://clubmarevabeirut.com/wp-content/uploads/2023/08/IMG_4006-scaled.jpeg\" alt=\"\" width=\"2560\" height=\"1920\" />\n\n&nbsp;\n\n<img class=\"aligncenter size-full wp-image-4013\" src=\"https://clubmarevabeirut.com/wp-content/uploads/2023/08/IMG_4003-scaled.jpeg\" alt=\"\" width=\"2560\" height=\"1920\" />",
    "text": "Club Mareva Beirut recently hosted a thrilling fundraising event with \"The Puffing Fez\" Cigar group, part of Lubnan Shriners, for the wellbeing of children in Lebanon. The night was alive with camaraderie, featuring a pairing of Drew Estate Undercrown Sungrown Toro and Glenfarclas 15. The event was a complete success, and we eagerly anticipate more collaborations. About Lubnan Shriners Lubnan Shriners is a dynamic force in Lebanon, representing more than just an organization; it symbolizes a beacon of hope and compassion. Operating with an unwavering commitment, it extends its support across the country, touching lives and nurturing dreams. Medical Assistance: Lubnan Shriners focuses on providing crucial medical aid to children and individuals in need. Whether it's through the renovation and equipment of pediatric clinics or collaborating with Shriners Hospitals for Children across the world, they ensure that those in need receive quality healthcare without financial burden. Their work includes not only treatments and surgeries but also essential follow-up care, enabling full recovery. Educational Support: Education is a core pillar of their mission. Lubnan Shriners believes that every child should have access to quality education, irrespective of their economic background. By providing scholarships, educational materials, and support to schools in underprivileged areas, they help in building a foundation for a brighter future. Their efforts have transformed lives, offering children the chance to pursue their dreams and break free from the cycle of poverty. Social Help: Beyond medical and educational spheres, Lubnan Shriners extends its support in various social aspects. Through community outreach programs, they assist families in distress, provide counseling, and create awareness about various social issues. Their clubs scattered throughout Lebanon actively engage in local communities, focusing on empowerment and upliftment. One Bright Smile at a Time: The true essence of Lubnan Shriners is captured in the smiles they bring to the faces of the children and individuals they help. Each successful treatment, each child attending school, and each family they support adds to the chain of smiles they have created. Their work is a testament to human empathy and the belief that even small acts of kindness can make significant changes. Through their dedicated efforts, Lubnan Shriners has become synonymous with hope, love, and care in Lebanon, nurturing a society where everyone has an equal chance to thrive. Spotlight on \"The Puffing Fez\" A fraternity of cigar enthusiasts, \"The Puffing Fez\" is focused on raising funds for pediatric clinics and assisting Lubnan Shriners in sending children for free treatments at Shriners Hospitals worldwide. A Night to Remember The evening was a fusion of fine cigars and philanthropy. Guests enjoyed exquisite pairings, conversations, and the satisfaction of contributing to a noble cause. The success of the fundraiser ignited hope and built lasting connections. Future Collaborations with \"The Puffing Fez\" Our collaboration with \"The Puffing Fez\" has sparked new excitement, and we are planning further joint ventures to extend our reach and impact. Be Part of the Change Join us at Club Mareva Beirut in our upcoming events to be part of a community that uses the passion for cigars as a vehicle for change. Thank you for your support, and we look forward to welcoming you again at Club Mareva Beirut, where cigars meet compassion."
  },
  "featured_image": {
    "original_url": "https://clubmarevabeirut.com/wp-content/uploads/2023/08/IMG_4010-scaled.jpeg",
    "local_path": "images/clubmarevabeirut/2023/IMG_4010-scaled.jpeg",
    "alt_text": ""
  },
  "images": [
    {
      "original_url": "https://clubmarevabeirut.com/wp-content/uploads/2023/08/IMG_4006-scaled.jpeg",
      "alt_text": "",
      "local_path": "images/clubmarevabeirut/2023/IMG_4006-scaled.jpeg"
    },
    {
      "original_url": "https://clubmarevabeirut.com/wp-content/uploads/2023/08/IMG_4003-scaled.jpeg",
      "alt_text": "",
      "local_path": "images/clubmarevabeirut/2023/IMG_4003-scaled.jpeg"
    }
  ],
  "embeds": {
    "youtube": [],
    "instagram": []
  }
}