{
  "id": 3982,
  "title": "Glenfarclas Lebanon Edition: A Whisky Journey Celebrating Two Proud Nations",
  "slug": "glenfarclas-lebanon-edition-a-whisky-journey-celebrating-two-proud-nations",
  "status": "publish",
  "date_created": "2023-07-27T19:00:35",
  "date_modified": "2023-08-09T21:12:07",
  "author": {
    "id": 2,
    "name": "Woody Ghsoubi",
    "login": "wghsoubi"
  },
  "categories": [
    "Events",
    "Mareva Malt Mavericks Tastings"
  ],
  "content": {
    "raw": "At Club Mareva Beirut, whisky enthusiasts gathered on Thursday 27 July 2023 for a memorable tasting event that celebrated the rich collaboration between two proud nations. The exclusive Glenfarclas Lebanon Edition 5 and Glenfarclas 15 took center stage, captivating the palates of seven attendees who were eager to embark on this unique whisky journey.\n<h4>A Collaboration of Scotland and Lebanon</h4>\nIn 2016, Elie Hanna, the distributor of Glenfarclas in Lebanon, envisioned a special single malt that would honor the distinct cultures of both Scotland and Lebanon. Glenfarclas, a renowned family-owned distillery known for its exceptional single malts, embraced the idea of a collaboration.\n\nScotland boasts a heritage of producing some of the finest single malt whiskies in the world, while Lebanon is known for its majestic cedar trees. The Glenfarclas Lebanon Edition was born from this beautiful fusion of traditions.\n\nElie Hanna convinced Glenfarclas to collaborate on a special Lebanon Edition whisky. The two casks were selected, and the label was reworked to include a cedar tree. The first Lebanon Edition was released in 2016. Due to its success, Edition 2 was released in 2017, Edition 3 in 2018 and Edition 4 in 2019.\n<h4>Edition 5: An Ode to Quality and Craftsmanship</h4>\nThe tasting event showcased the much-anticipated Glenfarclas Lebanon Edition 5, selected from Cask 3286. Distilled on May 25, 2000, and matured in a sherry butt, this whisky was bottled on July 28, 2022. Its creation was an artful process, resulting in a whisky that exudes elegance and complexity.\n<h4>A Symphony of Flavors and Aromas</h4>\nThe Glenfarclas Lebanon Edition 5 proved to be a highlight of the evening, captivating the tasters with its enchanting profile. On the nose, citrusy notes intertwine with delicate raisin accents, promising a delightful journey on the palate.\n\nWith each sip, the palate was treated to an exquisite dance of plums, raisins, and dried fruits, harmoniously intertwined to create a rich and flavorful experience. The finish was equally delightful, leaving lingering impressions of nuts, apples, and spices.\n<h4>A Tribute to Heritage and Nature</h4>\nThe Glenfarclas Lebanon Edition stands as a tribute to the shared heritage of Scotland and Lebanon. A whisky that marries the best of both worlds, it embodies the essence of craftsmanship and the harmony of nature.\n<h4>A Must-Try for Whisky Enthusiasts</h4>\nFor whisky lovers seeking exceptional and limited whiskies, the Glenfarclas Lebanon Edition is a true gem. Bottled at 52.8% ABV and non-chill filtered, only 30 bottles were released, making it a cherished find for collectors and connoisseurs.\n<h4>A Whisky Journey Continues</h4>\nAs the event concluded, the participants left with a profound appreciation for the Glenfarclas Lebanon Edition and the story it tells. The collaboration between two proud nations has resulted in a whisky experience that deserves a place on every whisky enthusiast's bucket list.\n<h4>A Special Thank You</h4>\nClub Mareva Beirut extends its sincere gratitude to Elie Hanna and Glenfarclas for bringing this exceptional whisky to Lebanon. The Glenfarclas Lebanon Edition is a true testament to the power of collaboration and the magic of whisky.\n\nIf you're eager to experience the Glenfarclas Lebanon Edition, visit Club Mareva Beirut to purchase your bottle.\n\n<em>Note: The tasting event showcased Glenfarclas 15 alongside the Lebanon Edition 5, enhancing the celebration of Glenfarclas craftsmanship.</em>\n\nCheers,\nYour Mareva Malt Mavericks Team\n\n[caption id=\"attachment_3986\" align=\"aligncenter\" width=\"2560\"]<img class=\"size-full wp-image-3986\" src=\"https://clubmarevabeirut.com/wp-content/uploads/2023/07/F4075E25-A953-47D2-82AD-2A1EA8C668D7_1_201_a-scaled.jpg\" alt=\"Glenfarclas Lebanon Edition 5\" width=\"2560\" height=\"1920\" /> Glenfarclas Lebanon Edition 5[/caption]",
    "clean": "At Club Mareva Beirut, whisky enthusiasts gathered on Thursday 27 July 2023 for a memorable tasting event that celebrated the rich collaboration between two proud nations. The exclusive Glenfarclas Lebanon Edition 5 and Glenfarclas 15 took center stage, captivating the palates of seven attendees who were eager to embark on this unique whisky journey.\n<h4>A Collaboration of Scotland and Lebanon</h4>\nIn 2016, Elie Hanna, the distributor of Glenfarclas in Lebanon, envisioned a special single malt that would honor the distinct cultures of both Scotland and Lebanon. Glenfarclas, a renowned family-owned distillery known for its exceptional single malts, embraced the idea of a collaboration.\n\nScotland boasts a heritage of producing some of the finest single malt whiskies in the world, while Lebanon is known for its majestic cedar trees. The Glenfarclas Lebanon Edition was born from this beautiful fusion of traditions.\n\nElie Hanna convinced Glenfarclas to collaborate on a special Lebanon Edition whisky. The two casks were selected, and the label was reworked to include a cedar tree. The first Lebanon Edition was released in 2016. Due to its success, Edition 2 was released in 2017, Edition 3 in 2018 and Edition 4 in 2019.\n<h4>Edition 5: An Ode to Quality and Craftsmanship</h4>\nThe tasting event showcased the much-anticipated Glenfarclas Lebanon Edition 5, selected from Cask 3286. Distilled on May 25, 2000, and matured in a sherry butt, this whisky was bottled on July 28, 2022. Its creation was an artful process, resulting in a whisky that exudes elegance and complexity.\n<h4>A Symphony of Flavors and Aromas</h4>\nThe Glenfarclas Lebanon Edition 5 proved to be a highlight of the evening, captivating the tasters with its enchanting profile. On the nose, citrusy notes intertwine with delicate raisin accents, promising a delightful journey on the palate.\n\nWith each sip, the palate was treated to an exquisite dance of plums, raisins, and dried fruits, harmoniously intertwined to create a rich and flavorful experience. The finish was equally delightful, leaving lingering impressions of nuts, apples, and spices.\n<h4>A Tribute to Heritage and Nature</h4>\nThe Glenfarclas Lebanon Edition stands as a tribute to the shared heritage of Scotland and Lebanon. A whisky that marries the best of both worlds, it embodies the essence of craftsmanship and the harmony of nature.\n<h4>A Must-Try for Whisky Enthusiasts</h4>\nFor whisky lovers seeking exceptional and limited whiskies, the Glenfarclas Lebanon Edition is a true gem. Bottled at 52.8% ABV and non-chill filtered, only 30 bottles were released, making it a cherished find for collectors and connoisseurs.\n<h4>A Whisky Journey Continues</h4>\nAs the event concluded, the participants left with a profound appreciation for the Glenfarclas Lebanon Edition and the story it tells. The collaboration between two proud nations has resulted in a whisky experience that deserves a place on every whisky enthusiast's bucket list.\n<h4>A Special Thank You</h4>\nClub Mareva Beirut extends its sincere gratitude to Elie Hanna and Glenfarclas for bringing this exceptional whisky to Lebanon. The Glenfarclas Lebanon Edition is a true testament to the power of collaboration and the magic of whisky.\n\nIf you're eager to experience the Glenfarclas Lebanon Edition, visit Club Mareva Beirut to purchase your bottle.\n\n<em>Note: The tasting event showcased Glenfarclas 15 alongside the Lebanon Edition 5, enhancing the celebration of Glenfarclas craftsmanship.</em>\n\nCheers,\nYour Mareva Malt Mavericks Team\n\n[caption id=\"attachment_3986\" align=\"aligncenter\" width=\"2560\"]<img class=\"size-full wp-image-3986\" src=\"https://clubmarevabeirut.com/wp-content/uploads/2023/07/F4075E25-A953-47D2-82AD-2A1EA8C668D7_1_201_a-scaled.jpg\" alt=\"Glenfarclas Lebanon Edition 5\" width=\"2560\" height=\"1920\" /> Glenfarclas Lebanon Edition 5[/caption]",
    "text": "At Club Mareva Beirut, whisky enthusiasts gathered on Thursday 27 July 2023 for a memorable tasting event that celebrated the rich collaboration between two proud nations. The exclusive Glenfarclas Lebanon Edition 5 and Glenfarclas 15 took center stage, captivating the palates of seven attendees who were eager to embark on this unique whisky journey. A Collaboration of Scotland and Lebanon In 2016, Elie Hanna, the distributor of Glenfarclas in Lebanon, envisioned a special single malt that would honor the distinct cultures of both Scotland and Lebanon. Glenfarclas, a renowned family-owned distillery known for its exceptional single malts, embraced the idea of a collaboration. Scotland boasts a heritage of producing some of the finest single malt whiskies in the world, while Lebanon is known for its majestic cedar trees. The Glenfarclas Lebanon Edition was born from this beautiful fusion of traditions. Elie Hanna convinced Glenfarclas to collaborate on a special Lebanon Edition whisky. The two casks were selected, and the label was reworked to include a cedar tree. The first Lebanon Edition was released in 2016. Due to its success, Edition 2 was released in 2017, Edition 3 in 2018 and Edition 4 in 2019. Edition 5: An Ode to Quality and Craftsmanship The tasting event showcased the much-anticipated Glenfarclas Lebanon Edition 5, selected from Cask 3286. Distilled on May 25, 2000, and matured in a sherry butt, this whisky was bottled on July 28, 2022. Its creation was an artful process, resulting in a whisky that exudes elegance and complexity. A Symphony of Flavors and Aromas The Glenfarclas Lebanon Edition 5 proved to be a highlight of the evening, captivating the tasters with its enchanting profile. On the nose, citrusy notes intertwine with delicate raisin accents, promising a delightful journey on the palate. With each sip, the palate was treated to an exquisite dance of plums, raisins, and dried fruits, harmoniously intertwined to create a rich and flavorful experience. The finish was equally delightful, leaving lingering impressions of nuts, apples, and spices. A Tribute to Heritage and Nature The Glenfarclas Lebanon Edition stands as a tribute to the shared heritage of Scotland and Lebanon. A whisky that marries the best of both worlds, it embodies the essence of craftsmanship and the harmony of nature. A Must-Try for Whisky Enthusiasts For whisky lovers seeking exceptional and limited whiskies, the Glenfarclas Lebanon Edition is a true gem. Bottled at 52.8% ABV and non-chill filtered, only 30 bottles were released, making it a cherished find for collectors and connoisseurs. A Whisky Journey Continues As the event concluded, the participants left with a profound appreciation for the Glenfarclas Lebanon Edition and the story it tells. The collaboration between two proud nations has resulted in a whisky experience that deserves a place on every whisky enthusiast's bucket list. A Special Thank You Club Mareva Beirut extends its sincere gratitude to Elie Hanna and Glenfarclas for bringing this exceptional whisky to Lebanon. The Glenfarclas Lebanon Edition is a true testament to the power of collaboration and the magic of whisky. If you're eager to experience the Glenfarclas Lebanon Edition, visit Club Mareva Beirut to purchase your bottle. Note: The tasting event showcased Glenfarclas 15 alongside the Lebanon Edition 5, enhancing the celebration of Glenfarclas craftsmanship. Cheers, Your Mareva Malt Mavericks Team [caption id=\"attachment_3986\" align=\"aligncenter\" width=\"2560\"] Glenfarclas Lebanon Edition 5[/caption]"
  },
  "featured_image": {
    "original_url": "https://clubmarevabeirut.com/wp-content/uploads/2023/07/IMG_3695-scaled.jpeg",
    "local_path": "images/clubmarevabeirut/2023/IMG_3695-scaled.jpeg",
    "alt_text": "Glenfarclas Lebanon Edition 5"
  },
  "images": [
    {
      "original_url": "https://clubmarevabeirut.com/wp-content/uploads/2023/07/F4075E25-A953-47D2-82AD-2A1EA8C668D7_1_201_a-scaled.jpg",
      "alt_text": "",
      "local_path": "images/clubmarevabeirut/2023/F4075E25-A953-47D2-82AD-2A1EA8C668D7_1_201_a-scaled.jpg"
    }
  ],
  "embeds": {
    "youtube": [],
    "instagram": []
  }
}