{
  "id": 3862,
  "title": "A Night of Whisky Exploration: The Mavericks’ Blind Tasting Tale",
  "slug": "a-night-of-whisky-exploration-the-mavericks-blind-tasting-tale",
  "status": "publish",
  "date_created": "2023-06-01T19:30:58",
  "date_modified": "2023-06-04T15:53:14",
  "author": {
    "id": 2,
    "name": "Woody Ghsoubi",
    "login": "wghsoubi"
  },
  "categories": [
    "Events",
    "Mareva Malt Mavericks Tastings"
  ],
  "content": {
    "raw": "Last Thursday, the Mavericks embarked on an epicurean escapade at the Club Mareva Beirut, exploring the enchanting world of whisky. This unforgettable journey was punctuated by lively discussions, shared camaraderie, and the exhilarating thrill of blind tasting. Now, let's take you through the highlights of our magical night.\n<h3>Bottle 1: Starward Wine Cask Edition - New World Projects</h3>\nThe evening's first reveal transported us to Australia's vibrant whisky scene with the Starward Wine Cask Edition from New World Projects. Aged in Australian red wine barrels, this innovative whisky presented a captivating medley of flavors. Touches of ripe berries, sweet honey, rich vanilla, and smooth caramel echoed the warmth of the Australian sun, launching our voyage on a delightful note.\n<ul>\n \t<li>Unique Notes: Red Berries, Vanilla</li>\n \t<li>Common Notes: Fruity, Honey, Oak, Spicy</li>\n</ul>\n<h3>Bottle 2: Macallan 12 Years Old Sherry Cask 2017</h3>\nOur next stop guided us to the heart of Scotland with the masterfully crafted Macallan 12 Years Old Sherry Cask 2017. This exquisite whisky, aged exclusively in select sherry-seasoned oak casks from Jerez, Spain, radiated a divine harmony of rich fruits, warm spices, and smoky oak undertones. Each sip was like peeling back a layer of a timeless masterpiece, unearthing more of its intricately woven character.\n<ul>\n \t<li>Unique Notes: Dried Fruits, Wood Smoke</li>\n \t<li>Common Notes: Spicy, Oak, Fruity</li>\n</ul>\n<h3>Bottle 3: anCnoc 18 Years Old</h3>\nThe tasting journey culminated with the revealing of the anCnoc 18 Years Old, our tasting's proverbial golden goose. This complex yet balanced whisky from Scotland's Highlands offered an intriguing melange of flavors, from the sweetness of ripe fruits to the warmth of delicate spices, all softened by the comforting embrace of oak. A fitting grand finale, it added an exciting crescendo to our tasting symphony.\n<ul>\n \t<li>Unique Notes: Sweet Ripe Fruits, Delicate Spices</li>\n \t<li>Common Notes: Oak, Fruity, Spicy</li>\n</ul>\n\n<hr />\n\nThroughout the evening, our Mavericks engaged in enriching discussions, debating each whisky's unique attributes. This collective conversation elevated our tasting event, instilling it with a sense of shared exploration and camaraderie.\n\nCentral to our whisky journey was the practice of blind tasting. This method, stripped of branding and preconceptions, enabled our Mavericks to focus solely on the whiskies' sensory attributes. It encouraged a more honest appreciation of each dram, free from biases and preformed judgments.\n\nIn the world of whisky appreciation, blind tasting serves as an invaluable tool for developing an unbiased palate. It brings drinkers back to the whisky's essence, reminding us that it's not the branding, the price, or even the age that truly matters, but the sensory joy that each bottle delivers.\n\nAs the night unfurled, it was clear that our blind tasting approach offered an enhanced appreciation for each bottle, pushing us to revise our notions and uncover surprising preferences. This whisky exploration was not just a journey into the spirit's captivating world, but a voyage into our own sensory perceptions.\n\nThe Maverick spirit stands for more than just tasting whisky; it's about fully immersing in the experience, guided by curiosity and a thirst for discovery. Here's to more unforgettable nights, brimming with exploration and the joy of shared experiences.\n\nOnward, Mavericks, to the next whisky adventure,\n\nYour Mareva Malt Mavericks Team 🥃🎉\n\n&nbsp;\n\n<img class=\"aligncenter size-full wp-image-3866\" src=\"https://clubmarevabeirut.com/wp-content/uploads/2023/06/WhatsApp-Image-2023-06-01-at-8.55.42-PM.jpeg\" alt=\"\" width=\"739\" height=\"1024\" />\n\n<img class=\"aligncenter size-full wp-image-3864\" src=\"https://clubmarevabeirut.com/wp-content/uploads/2023/06/AF6A4BDD-3EA3-4EFE-A4E7-44FF0D3F3823-scaled.jpeg\" alt=\"\" width=\"1920\" height=\"2560\" />\n\n&nbsp;",
    "clean": "Last Thursday, the Mavericks embarked on an epicurean escapade at the Club Mareva Beirut, exploring the enchanting world of whisky. This unforgettable journey was punctuated by lively discussions, shared camaraderie, and the exhilarating thrill of blind tasting. Now, let's take you through the highlights of our magical night.\n<h3>Bottle 1: Starward Wine Cask Edition - New World Projects</h3>\nThe evening's first reveal transported us to Australia's vibrant whisky scene with the Starward Wine Cask Edition from New World Projects. Aged in Australian red wine barrels, this innovative whisky presented a captivating medley of flavors. Touches of ripe berries, sweet honey, rich vanilla, and smooth caramel echoed the warmth of the Australian sun, launching our voyage on a delightful note.\n<ul>\n \t<li>Unique Notes: Red Berries, Vanilla</li>\n \t<li>Common Notes: Fruity, Honey, Oak, Spicy</li>\n</ul>\n<h3>Bottle 2: Macallan 12 Years Old Sherry Cask 2017</h3>\nOur next stop guided us to the heart of Scotland with the masterfully crafted Macallan 12 Years Old Sherry Cask 2017. This exquisite whisky, aged exclusively in select sherry-seasoned oak casks from Jerez, Spain, radiated a divine harmony of rich fruits, warm spices, and smoky oak undertones. Each sip was like peeling back a layer of a timeless masterpiece, unearthing more of its intricately woven character.\n<ul>\n \t<li>Unique Notes: Dried Fruits, Wood Smoke</li>\n \t<li>Common Notes: Spicy, Oak, Fruity</li>\n</ul>\n<h3>Bottle 3: anCnoc 18 Years Old</h3>\nThe tasting journey culminated with the revealing of the anCnoc 18 Years Old, our tasting's proverbial golden goose. This complex yet balanced whisky from Scotland's Highlands offered an intriguing melange of flavors, from the sweetness of ripe fruits to the warmth of delicate spices, all softened by the comforting embrace of oak. A fitting grand finale, it added an exciting crescendo to our tasting symphony.\n<ul>\n \t<li>Unique Notes: Sweet Ripe Fruits, Delicate Spices</li>\n \t<li>Common Notes: Oak, Fruity, Spicy</li>\n</ul>\n\n<hr />\n\nThroughout the evening, our Mavericks engaged in enriching discussions, debating each whisky's unique attributes. This collective conversation elevated our tasting event, instilling it with a sense of shared exploration and camaraderie.\n\nCentral to our whisky journey was the practice of blind tasting. This method, stripped of branding and preconceptions, enabled our Mavericks to focus solely on the whiskies' sensory attributes. It encouraged a more honest appreciation of each dram, free from biases and preformed judgments.\n\nIn the world of whisky appreciation, blind tasting serves as an invaluable tool for developing an unbiased palate. It brings drinkers back to the whisky's essence, reminding us that it's not the branding, the price, or even the age that truly matters, but the sensory joy that each bottle delivers.\n\nAs the night unfurled, it was clear that our blind tasting approach offered an enhanced appreciation for each bottle, pushing us to revise our notions and uncover surprising preferences. This whisky exploration was not just a journey into the spirit's captivating world, but a voyage into our own sensory perceptions.\n\nThe Maverick spirit stands for more than just tasting whisky; it's about fully immersing in the experience, guided by curiosity and a thirst for discovery. Here's to more unforgettable nights, brimming with exploration and the joy of shared experiences.\n\nOnward, Mavericks, to the next whisky adventure,\n\nYour Mareva Malt Mavericks Team 🥃🎉\n\n&nbsp;\n\n<img class=\"aligncenter size-full wp-image-3866\" src=\"https://clubmarevabeirut.com/wp-content/uploads/2023/06/WhatsApp-Image-2023-06-01-at-8.55.42-PM.jpeg\" alt=\"\" width=\"739\" height=\"1024\" />\n\n<img class=\"aligncenter size-full wp-image-3864\" src=\"https://clubmarevabeirut.com/wp-content/uploads/2023/06/AF6A4BDD-3EA3-4EFE-A4E7-44FF0D3F3823-scaled.jpeg\" alt=\"\" width=\"1920\" height=\"2560\" />\n\n&nbsp;",
    "text": "Last Thursday, the Mavericks embarked on an epicurean escapade at the Club Mareva Beirut, exploring the enchanting world of whisky. This unforgettable journey was punctuated by lively discussions, shared camaraderie, and the exhilarating thrill of blind tasting. Now, let's take you through the highlights of our magical night. Bottle 1: Starward Wine Cask Edition - New World Projects The evening's first reveal transported us to Australia's vibrant whisky scene with the Starward Wine Cask Edition from New World Projects. Aged in Australian red wine barrels, this innovative whisky presented a captivating medley of flavors. Touches of ripe berries, sweet honey, rich vanilla, and smooth caramel echoed the warmth of the Australian sun, launching our voyage on a delightful note. Unique Notes: Red Berries, Vanilla Common Notes: Fruity, Honey, Oak, Spicy Bottle 2: Macallan 12 Years Old Sherry Cask 2017 Our next stop guided us to the heart of Scotland with the masterfully crafted Macallan 12 Years Old Sherry Cask 2017. This exquisite whisky, aged exclusively in select sherry-seasoned oak casks from Jerez, Spain, radiated a divine harmony of rich fruits, warm spices, and smoky oak undertones. Each sip was like peeling back a layer of a timeless masterpiece, unearthing more of its intricately woven character. Unique Notes: Dried Fruits, Wood Smoke Common Notes: Spicy, Oak, Fruity Bottle 3: anCnoc 18 Years Old The tasting journey culminated with the revealing of the anCnoc 18 Years Old, our tasting's proverbial golden goose. This complex yet balanced whisky from Scotland's Highlands offered an intriguing melange of flavors, from the sweetness of ripe fruits to the warmth of delicate spices, all softened by the comforting embrace of oak. A fitting grand finale, it added an exciting crescendo to our tasting symphony. Unique Notes: Sweet Ripe Fruits, Delicate Spices Common Notes: Oak, Fruity, Spicy Throughout the evening, our Mavericks engaged in enriching discussions, debating each whisky's unique attributes. This collective conversation elevated our tasting event, instilling it with a sense of shared exploration and camaraderie. Central to our whisky journey was the practice of blind tasting. This method, stripped of branding and preconceptions, enabled our Mavericks to focus solely on the whiskies' sensory attributes. It encouraged a more honest appreciation of each dram, free from biases and preformed judgments. In the world of whisky appreciation, blind tasting serves as an invaluable tool for developing an unbiased palate. It brings drinkers back to the whisky's essence, reminding us that it's not the branding, the price, or even the age that truly matters, but the sensory joy that each bottle delivers. As the night unfurled, it was clear that our blind tasting approach offered an enhanced appreciation for each bottle, pushing us to revise our notions and uncover surprising preferences. This whisky exploration was not just a journey into the spirit's captivating world, but a voyage into our own sensory perceptions. The Maverick spirit stands for more than just tasting whisky; it's about fully immersing in the experience, guided by curiosity and a thirst for discovery. Here's to more unforgettable nights, brimming with exploration and the joy of shared experiences. Onward, Mavericks, to the next whisky adventure, Your Mareva Malt Mavericks Team 🥃🎉"
  },
  "featured_image": {
    "original_url": "https://clubmarevabeirut.com/wp-content/uploads/2023/06/3FC660D5-F945-466F-A228-72FB0AA72AA5-scaled.jpeg",
    "local_path": "images/clubmarevabeirut/2023/3FC660D5-F945-466F-A228-72FB0AA72AA5-scaled.jpeg",
    "alt_text": ""
  },
  "images": [
    {
      "original_url": "https://clubmarevabeirut.com/wp-content/uploads/2023/06/WhatsApp-Image-2023-06-01-at-8.55.42-PM.jpeg",
      "alt_text": "",
      "local_path": "images/clubmarevabeirut/2023/WhatsApp-Image-2023-06-01-at-8.55.42-PM.jpeg"
    },
    {
      "original_url": "https://clubmarevabeirut.com/wp-content/uploads/2023/06/AF6A4BDD-3EA3-4EFE-A4E7-44FF0D3F3823-scaled.jpeg",
      "alt_text": "",
      "local_path": "images/clubmarevabeirut/2023/AF6A4BDD-3EA3-4EFE-A4E7-44FF0D3F3823-scaled.jpeg"
    }
  ],
  "embeds": {
    "youtube": [],
    "instagram": []
  }
}