{
  "id": 3775,
  "title": "Reviving the Future of Cuban Cigars: A Roundtable Discussion at Club Mareva Beirut",
  "slug": "reviving-the-future-of-cuban-cigars-a-roundtable-discussion-at-club-mareva-beirut",
  "status": "publish",
  "date_created": "2023-04-22T11:48:40",
  "date_modified": "2023-04-22T11:53:07",
  "author": {
    "id": 2,
    "name": "Woody Ghsoubi",
    "login": "wghsoubi"
  },
  "categories": [
    "News"
  ],
  "content": {
    "raw": "Dear Club Mareva Beirut community,\n\nToday, we had the pleasure of hosting a meeting at Club Mareva Beirut cigar lounge with esteemed personalities from the world of Habanos. Our discussion revolved around the current situation of Cuban cigars, addressing issues such as shortages, price increases, and the future of Habanos.\n\nWe were joined by Ms. Maritza Carrillo, the newly-appointed Co-President of Corporación Habanos, S.A., who shared positive news about the availability of products and the recent improvements in quality control. She also mentioned the establishment of a new, state-of-the-art box factory in Cuba, which will be used for creating new cigar boxes.\n\nOther notable attendees included Mr. Walid Saleh, CEO of Phoenicia Trading, one of the largest distributors of Habanos S.A. in the world; Mr. Ziad Zeidan, GM of Phoenicia Trading and son of founder Mohamed Zeidan; and Mr. Wael Zeidan, GM of local market distribution of Habanos products and manager of La Casa Del Habanos in Lebanon.\n\nDuring the meeting, we discussed the significant price increases of the Cohiba and Trinidad brands, as well as the possibility of Habanos S.A. reviving old brands. We also addressed the challenges faced by CubaTabaco, but it was reassuring to hear that things are on the mend.\n\nWe appreciate the valuable insights shared by our distinguished guests and look forward to continuing our partnership to ensure a bright future for Habanos and the cigar community at large.\n\n&nbsp;\n\nSincerely,\n\nWoody Ghsoubi and Najat Abdo\nOwners of Club Mareva Beirut Cigar Lounge",
    "clean": "Dear Club Mareva Beirut community,\n\nToday, we had the pleasure of hosting a meeting at Club Mareva Beirut cigar lounge with esteemed personalities from the world of Habanos. Our discussion revolved around the current situation of Cuban cigars, addressing issues such as shortages, price increases, and the future of Habanos.\n\nWe were joined by Ms. Maritza Carrillo, the newly-appointed Co-President of Corporación Habanos, S.A., who shared positive news about the availability of products and the recent improvements in quality control. She also mentioned the establishment of a new, state-of-the-art box factory in Cuba, which will be used for creating new cigar boxes.\n\nOther notable attendees included Mr. Walid Saleh, CEO of Phoenicia Trading, one of the largest distributors of Habanos S.A. in the world; Mr. Ziad Zeidan, GM of Phoenicia Trading and son of founder Mohamed Zeidan; and Mr. Wael Zeidan, GM of local market distribution of Habanos products and manager of La Casa Del Habanos in Lebanon.\n\nDuring the meeting, we discussed the significant price increases of the Cohiba and Trinidad brands, as well as the possibility of Habanos S.A. reviving old brands. We also addressed the challenges faced by CubaTabaco, but it was reassuring to hear that things are on the mend.\n\nWe appreciate the valuable insights shared by our distinguished guests and look forward to continuing our partnership to ensure a bright future for Habanos and the cigar community at large.\n\n&nbsp;\n\nSincerely,\n\nWoody Ghsoubi and Najat Abdo\nOwners of Club Mareva Beirut Cigar Lounge",
    "text": "Dear Club Mareva Beirut community, Today, we had the pleasure of hosting a meeting at Club Mareva Beirut cigar lounge with esteemed personalities from the world of Habanos. Our discussion revolved around the current situation of Cuban cigars, addressing issues such as shortages, price increases, and the future of Habanos. We were joined by Ms. Maritza Carrillo, the newly-appointed Co-President of Corporación Habanos, S.A., who shared positive news about the availability of products and the recent improvements in quality control. She also mentioned the establishment of a new, state-of-the-art box factory in Cuba, which will be used for creating new cigar boxes. Other notable attendees included Mr. Walid Saleh, CEO of Phoenicia Trading, one of the largest distributors of Habanos S.A. in the world; Mr. Ziad Zeidan, GM of Phoenicia Trading and son of founder Mohamed Zeidan; and Mr. Wael Zeidan, GM of local market distribution of Habanos products and manager of La Casa Del Habanos in Lebanon. During the meeting, we discussed the significant price increases of the Cohiba and Trinidad brands, as well as the possibility of Habanos S.A. reviving old brands. We also addressed the challenges faced by CubaTabaco, but it was reassuring to hear that things are on the mend. We appreciate the valuable insights shared by our distinguished guests and look forward to continuing our partnership to ensure a bright future for Habanos and the cigar community at large. Sincerely, Woody Ghsoubi and Najat Abdo Owners of Club Mareva Beirut Cigar Lounge"
  },
  "featured_image": {
    "original_url": "https://clubmarevabeirut.com/wp-content/uploads/2023/04/IMG_7607-scaled.jpeg",
    "local_path": "images/clubmarevabeirut/2023/IMG_7607-scaled.jpeg",
    "alt_text": ""
  },
  "images": [],
  "embeds": {
    "youtube": [],
    "instagram": []
  }
}