{
  "id": 3768,
  "title": "Kilkerran Sherry Cask Whisky Tasting at Club Mareva Beirut with the Mareva Malt Mavericks",
  "slug": "a-night-to-remember-kilkerran-sherry-cask-whisky-tasting-at-club-mareva-beirut-with-the-mareva-malt-mavericks",
  "status": "publish",
  "date_created": "2023-04-20T15:43:23",
  "date_modified": "2023-05-19T12:21:08",
  "author": {
    "id": 2,
    "name": "Woody Ghsoubi",
    "login": "wghsoubi"
  },
  "categories": [
    "Events",
    "Mareva Malt Mavericks Tastings"
  ],
  "content": {
    "raw": "Club Mareva Beirut, in collaboration with the Mareva Malt Mavericks, had the pleasure of hosting an unforgettable whisky tasting event on April 20th, 2023, at our comfortable cigar lounge. The Mareva Malt Mavericks is a group dedicated to whiskey enthusiasts who are interested in attending tastings at Club Mareva Beirut. Managed by the community, for the community, this group connects like-minded individuals who share a passion for the art of whiskey tasting. Members enjoy discussions, event updates, tastings, and exclusive access to the latest and greatest in the world of malt whiskey.\n\nThe star of the night was the exquisite Glengyle Distillery Kilkerran Sherry Cask Matured 8 Year Old Single Malt Scotch Whisky from Campbeltown, Scotland. This limited production, award-winning whisky was enjoyed by an intimate group of 12 enthusiasts who were eager to explore the unique flavors of Kilkerran.\n\n<img class=\"aligncenter size-full wp-image-3770\" src=\"https://clubmarevabeirut.com/wp-content/uploads/2023/04/IMG_9240-scaled.jpeg\" alt=\"\" width=\"1920\" height=\"2560\" />\n\nThe evening kicked off at 7:30 PM with the warm welcome of our guests, followed by a brief introduction to the Kilkerran Sherry Cask Matured whisky by our knowledgeable presenter, Ricardo Safar. The atmosphere was cozy and inviting, perfectly complementing the rich and complex flavors of the whisky.\n\nRicardo guided the tasters through the history of the Glengyle Distillery and the meticulous process of crafting the Kilkerran Sherry Cask Matured whisky. The single malt spent eight years maturing in high-quality sherry casks, which imparted it with an incredible depth of flavor and a beautiful, natural color.\n\nAs our members sipped on their drams, they were encouraged to share their thoughts on the aroma, taste, and finish of the whisky. Among the most prominent notes, tasters identified a sweet nose of dried fruits, toffee, and vanilla, alongside a hint of peat smoke. On the palate, the whisky revealed flavors of chocolate, raisins, and a subtle nuttiness, with a touch of maritime saltiness. The finish was long, warming, and slightly smoky, leaving a lasting impression on our guests.\n\nThe evening was not only about the exceptional whisky but also about the camaraderie among our members. Conversations flowed naturally as the tasters exchanged their experiences and thoughts on the Kilkerran Sherry Cask Matured whisky. This event was a testament to the power of a shared passion for whisky, as it brought together a diverse group of individuals who bonded over their mutual love for the spirit.\n\nThe Kilkerran Sherry Cask whisky tasting event at Club Mareva Beirut was an immense success. It was an evening of discovery, conversation, and enjoyment for all attendees. We would like to thank our members for their enthusiastic participation and our presenter, Ricardo Safar, for his valuable insights.\n\nClub Mareva Beirut is committed to hosting more exclusive tasting events in the future, giving our members the chance to experience exceptional whiskies from around the world. Keep an eye on our website and social media channels for updates on upcoming events. Cheers! 🥃\n\n&nbsp;\n\n<img class=\"aligncenter size-full wp-image-3772\" src=\"https://clubmarevabeirut.com/wp-content/uploads/2023/04/F6FF91E2-E7A4-4108-8495-B079DD4D80D5_1_102_o.jpeg\" alt=\"\" width=\"1536\" height=\"2048\" />",
    "clean": "Club Mareva Beirut, in collaboration with the Mareva Malt Mavericks, had the pleasure of hosting an unforgettable whisky tasting event on April 20th, 2023, at our comfortable cigar lounge. The Mareva Malt Mavericks is a group dedicated to whiskey enthusiasts who are interested in attending tastings at Club Mareva Beirut. Managed by the community, for the community, this group connects like-minded individuals who share a passion for the art of whiskey tasting. Members enjoy discussions, event updates, tastings, and exclusive access to the latest and greatest in the world of malt whiskey.\n\nThe star of the night was the exquisite Glengyle Distillery Kilkerran Sherry Cask Matured 8 Year Old Single Malt Scotch Whisky from Campbeltown, Scotland. This limited production, award-winning whisky was enjoyed by an intimate group of 12 enthusiasts who were eager to explore the unique flavors of Kilkerran.\n\n<img class=\"aligncenter size-full wp-image-3770\" src=\"https://clubmarevabeirut.com/wp-content/uploads/2023/04/IMG_9240-scaled.jpeg\" alt=\"\" width=\"1920\" height=\"2560\" />\n\nThe evening kicked off at 7:30 PM with the warm welcome of our guests, followed by a brief introduction to the Kilkerran Sherry Cask Matured whisky by our knowledgeable presenter, Ricardo Safar. The atmosphere was cozy and inviting, perfectly complementing the rich and complex flavors of the whisky.\n\nRicardo guided the tasters through the history of the Glengyle Distillery and the meticulous process of crafting the Kilkerran Sherry Cask Matured whisky. The single malt spent eight years maturing in high-quality sherry casks, which imparted it with an incredible depth of flavor and a beautiful, natural color.\n\nAs our members sipped on their drams, they were encouraged to share their thoughts on the aroma, taste, and finish of the whisky. Among the most prominent notes, tasters identified a sweet nose of dried fruits, toffee, and vanilla, alongside a hint of peat smoke. On the palate, the whisky revealed flavors of chocolate, raisins, and a subtle nuttiness, with a touch of maritime saltiness. The finish was long, warming, and slightly smoky, leaving a lasting impression on our guests.\n\nThe evening was not only about the exceptional whisky but also about the camaraderie among our members. Conversations flowed naturally as the tasters exchanged their experiences and thoughts on the Kilkerran Sherry Cask Matured whisky. This event was a testament to the power of a shared passion for whisky, as it brought together a diverse group of individuals who bonded over their mutual love for the spirit.\n\nThe Kilkerran Sherry Cask whisky tasting event at Club Mareva Beirut was an immense success. It was an evening of discovery, conversation, and enjoyment for all attendees. We would like to thank our members for their enthusiastic participation and our presenter, Ricardo Safar, for his valuable insights.\n\nClub Mareva Beirut is committed to hosting more exclusive tasting events in the future, giving our members the chance to experience exceptional whiskies from around the world. Keep an eye on our website and social media channels for updates on upcoming events. Cheers! 🥃\n\n&nbsp;\n\n<img class=\"aligncenter size-full wp-image-3772\" src=\"https://clubmarevabeirut.com/wp-content/uploads/2023/04/F6FF91E2-E7A4-4108-8495-B079DD4D80D5_1_102_o.jpeg\" alt=\"\" width=\"1536\" height=\"2048\" />",
    "text": "Club Mareva Beirut, in collaboration with the Mareva Malt Mavericks, had the pleasure of hosting an unforgettable whisky tasting event on April 20th, 2023, at our comfortable cigar lounge. The Mareva Malt Mavericks is a group dedicated to whiskey enthusiasts who are interested in attending tastings at Club Mareva Beirut. Managed by the community, for the community, this group connects like-minded individuals who share a passion for the art of whiskey tasting. Members enjoy discussions, event updates, tastings, and exclusive access to the latest and greatest in the world of malt whiskey. The star of the night was the exquisite Glengyle Distillery Kilkerran Sherry Cask Matured 8 Year Old Single Malt Scotch Whisky from Campbeltown, Scotland. This limited production, award-winning whisky was enjoyed by an intimate group of 12 enthusiasts who were eager to explore the unique flavors of Kilkerran. The evening kicked off at 7:30 PM with the warm welcome of our guests, followed by a brief introduction to the Kilkerran Sherry Cask Matured whisky by our knowledgeable presenter, Ricardo Safar. The atmosphere was cozy and inviting, perfectly complementing the rich and complex flavors of the whisky. Ricardo guided the tasters through the history of the Glengyle Distillery and the meticulous process of crafting the Kilkerran Sherry Cask Matured whisky. The single malt spent eight years maturing in high-quality sherry casks, which imparted it with an incredible depth of flavor and a beautiful, natural color. As our members sipped on their drams, they were encouraged to share their thoughts on the aroma, taste, and finish of the whisky. Among the most prominent notes, tasters identified a sweet nose of dried fruits, toffee, and vanilla, alongside a hint of peat smoke. On the palate, the whisky revealed flavors of chocolate, raisins, and a subtle nuttiness, with a touch of maritime saltiness. The finish was long, warming, and slightly smoky, leaving a lasting impression on our guests. The evening was not only about the exceptional whisky but also about the camaraderie among our members. Conversations flowed naturally as the tasters exchanged their experiences and thoughts on the Kilkerran Sherry Cask Matured whisky. This event was a testament to the power of a shared passion for whisky, as it brought together a diverse group of individuals who bonded over their mutual love for the spirit. The Kilkerran Sherry Cask whisky tasting event at Club Mareva Beirut was an immense success. It was an evening of discovery, conversation, and enjoyment for all attendees. We would like to thank our members for their enthusiastic participation and our presenter, Ricardo Safar, for his valuable insights. Club Mareva Beirut is committed to hosting more exclusive tasting events in the future, giving our members the chance to experience exceptional whiskies from around the world. Keep an eye on our website and social media channels for updates on upcoming events. Cheers! 🥃"
  },
  "featured_image": {
    "original_url": "https://clubmarevabeirut.com/wp-content/uploads/2023/04/IMG_7585-scaled.jpeg",
    "local_path": "images/clubmarevabeirut/2023/IMG_7585-scaled.jpeg",
    "alt_text": ""
  },
  "images": [
    {
      "original_url": "https://clubmarevabeirut.com/wp-content/uploads/2023/04/IMG_9240-scaled.jpeg",
      "alt_text": "",
      "local_path": "images/clubmarevabeirut/2023/IMG_9240-scaled.jpeg"
    },
    {
      "original_url": "https://clubmarevabeirut.com/wp-content/uploads/2023/04/F6FF91E2-E7A4-4108-8495-B079DD4D80D5_1_102_o.jpeg",
      "alt_text": "",
      "local_path": "images/clubmarevabeirut/2023/F6FF91E2-E7A4-4108-8495-B079DD4D80D5_1_102_o.jpeg"
    }
  ],
  "embeds": {
    "youtube": [],
    "instagram": []
  }
}